<?xml version="1.0" encoding="utf-8"?>
<feed xmlns="http://www.w3.org/2005/Atom">
  <title>Junlong Liu</title>
  
  <link href="/atom.xml" rel="self"/>
  
  <link href="https://omgteam.github.io/"/>
  <updated>2016-08-16T13:06:06.000Z</updated>
  <id>https://omgteam.github.io/</id>
  
  <author>
    <name>Junlong Liu</name>
    
  </author>
  
  <generator uri="http://hexo.io/">Hexo</generator>
  
  <entry>
    <title>从概念上看看深度学习为什么成功？</title>
    <link href="https://omgteam.github.io/2016/08/16/ds-dl/"/>
    <id>https://omgteam.github.io/2016/08/16/ds-dl/</id>
    <published>2016-08-16T09:55:21.000Z</published>
    <updated>2016-08-16T13:06:06.000Z</updated>
    
    <content type="html"><![CDATA[<p>&#x8FD9;&#x91CC;&#x4EE5;&#x6982;&#x5FF5;&#x5206;&#x6790;&#x4E3A;&#x4E3B;&#x53D9;&#x8FF0;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x7684;&#x90E8;&#x5206;&#x7406;&#x8BBA;&#x57FA;&#x7840;&#x3002;&#x4E3B;&#x8981;&#x6458;&#x5F55;&#x4E86;CVPR 2016 Tutorial&#x91CC;The mathematics of deep learning &#x7684;Data structure based theory for deep learning &#x62A5;&#x544A;&#x8981;&#x70B9;&#x3002;[1]</p>
<a id="more"></a>
<p>&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x7684;&#x6838;&#x5FC3;&#x7ED3;&#x6784;&#x662F;&#x6DF1;&#x5EA6;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x3002;<br>&#x6DF1;&#x5EA6;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x662F;&#x4E00;&#x7CFB;&#x5217;&#x7EBF;&#x6027;&#x548C;&#x975E;&#x7EBF;&#x6027;&#x53D8;&#x5316;&#x7684;&#x7F51;&#x7EDC;&#x5C42;&#x5806;&#x53E0;&#x3002;<br><img src="/2016/08/16/ds-dl/dnn.jpg" alt="logo"><br>&#x6DF1;&#x5EA6;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7684;&#x82E5;&#x5E72;&#x91CD;&#x8981;&#x7406;&#x8BBA;&#x6027;&#x8D28;&#x5305;&#x62EC;&#xFF1A;<br>    1&#xFF0C;&#x53EF;&#x8868;&#x793A;&#x4EFB;&#x610F;&#x51FD;&#x6570;&#xFF08;Universal approximation for any measurable Borel functions&#xFF09;&#xFF1B;<br>    2&#xFF0C;&#x968F;&#x7740;&#x6DF1;&#x5EA6;&#x589E;&#x52A0;&#xFF0C;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7684;&#x8868;&#x8FBE;&#x80FD;&#x529B;&#x5448;&#x6307;&#x6570;&#x589E;&#x957F;&#xFF1B;<br>    3&#xFF0C;&#x968F;&#x7740;&#x6DF1;&#x5EA6;&#x589E;&#x52A0;&#xFF0C;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x6709;&#x66F4;&#x591A;&#x7684;&#x5C40;&#x90E8;&#x6700;&#x4F18;&#x70B9;&#x63A5;&#x8FD1;&#x5168;&#x5C40;&#x6700;&#x4F18;&#x70B9;&#x3002;</p>
<p>&#x4ECE;&#x5177;&#x4F53;&#x7684;&#x7F51;&#x7EDC;&#x5C42;&#x7684;&#x7ED3;&#x6784;&#x8BBE;&#x8BA1;&#x548C;&#x6570;&#x503C;&#x521D;&#x59CB;&#x5316;&#x6765;&#x8BF4;&#xFF1A;<br>    1&#xFF0C;&#x6DF1;&#x5EA6;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x53EF;&#x4EE5;&#x4FDD;&#x7559;&#x8F93;&#x5165;&#x6570;&#x636E;&#x7684;&#x91CD;&#x8981;&#x4FE1;&#x606F;&#xFF1B;<br>        &#x5373;&#x901A;&#x8FC7;&#x4E00;&#x5C42;&#x7F51;&#x7EDC;&#x53D8;&#x6362;&#x540E;&#x7684;&#x4FE1;&#x606F;&#x548C;&#x8F93;&#x5165;&#x4FE1;&#x606F;&#x7684;&#x5DEE;&#x5F02;&#x6709;&#x4E0A;&#x9650;&#x7406;&#x8BBA;&#x4FDD;&#x8BC1;&#x3002;<br><img src="/2016/08/16/ds-dl/info.jpg" alt="logo"><br>    2&#xFF0C;&#x4F7F;&#x7528;&#x968F;&#x673A;&#x9AD8;&#x65AF;&#x5206;&#x5E03;&#x521D;&#x59CB;&#x5316;&#x6743;&#x503C;&#xFF0C;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x80FD;&#x4FDD;&#x6301;&#x6837;&#x672C;&#x95F4;&#x7684;&#x8DDD;&#x79BB;&#x548C;&#x89D2;&#x5EA6;&#x5E8F;&#x5173;&#x7CFB;&#xFF1B;<br><img src="/2016/08/16/ds-dl/dis.jpg" alt="logo"><br>    3&#xFF0C;&#x6DF1;&#x5EA6;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7684;&#x6CDB;&#x5316;&#x80FD;&#x529B;&#x5177;&#x6709;&#x7406;&#x8BBA;&#x4FDD;&#x8BC1;&#xFF1B;<br>        &#x5373;&#x6DF1;&#x5EA6;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x5728;&#x8BAD;&#x7EC3;&#x96C6;&#x548C;&#x6D4B;&#x8BD5;&#x96C6;&#x7684;&#x7CBE;&#x5EA6;&#x8BEF;&#x5DEE;&#x5B58;&#x5728;&#x7406;&#x8BBA;&#x4E0A;&#x7EBF;&#x3002;<br><img src="/2016/08/16/ds-dl/ge.jpg" alt="logo"></p>
<p>[1] <a href="http://www.vision.jhu.edu/tutorials/CVPR16-Tutorial-Math-Deep-Learning-Raja.pdf" target="_blank" rel="external">http://www.vision.jhu.edu/tutorials/CVPR16-Tutorial-Math-Deep-Learning-Raja.pdf</a></p>
]]></content>
    
    <summary type="html">
    
      &lt;p&gt;&amp;#x8FD9;&amp;#x91CC;&amp;#x4EE5;&amp;#x6982;&amp;#x5FF5;&amp;#x5206;&amp;#x6790;&amp;#x4E3A;&amp;#x4E3B;&amp;#x53D9;&amp;#x8FF0;&amp;#x6DF1;&amp;#x5EA6;&amp;#x5B66;&amp;#x4E60;&amp;#x7684;&amp;#x90E8;&amp;#x5206;&amp;#x7406;&amp;#x8BBA;&amp;#x57FA;&amp;#x7840;&amp;#x3002;&amp;#x4E3B;&amp;#x8981;&amp;#x6458;&amp;#x5F55;&amp;#x4E86;CVPR 2016 Tutorial&amp;#x91CC;The mathematics of deep learning &amp;#x7684;Data structure based theory for deep learning &amp;#x62A5;&amp;#x544A;&amp;#x8981;&amp;#x70B9;&amp;#x3002;[1]&lt;/p&gt;
    
    </summary>
    
    
  </entry>
  
  <entry>
    <title>从概念上看看聊天机器人的商业模式</title>
    <link href="https://omgteam.github.io/2016/08/13/chat-bot/"/>
    <id>https://omgteam.github.io/2016/08/13/chat-bot/</id>
    <published>2016-08-13T04:16:13.000Z</published>
    <updated>2016-08-13T05:23:56.000Z</updated>
    
    <content type="html"><![CDATA[<p>2016&#x5E74;&#x804A;&#x5929;&#x673A;&#x5668;&#x4EBA;&#x76F8;&#x5173;&#x521B;&#x4E1A;&#x548C;&#x65B0;&#x95FB;&#x5C42;&#x51FA;&#x4E0D;&#x7A77;&#x3002;&#x5B66;&#x672F;&#x652F;&#x6491;&#x548C;&#x5546;&#x4E1A;&#x6A21;&#x5F0F;&#x90FD;&#x6709;&#x54EA;&#x4E9B;&#x53EF;&#x884C;&#x57DF;&#x5462;&#xFF1F;<br><a id="more"></a><br>&#x7531;&#x4E8E;&#x8FD1;&#x4E9B;&#x5E74;&#x6765;&#xFF0C;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x7684;&#x53D1;&#x5C55;&#x7ED9;&#x81EA;&#x7136;&#x8BED;&#x8A00;&#x7406;&#x89E3;&#x548C;&#x81EA;&#x7136;&#x8BED;&#x8A00;&#x751F;&#x6210;&#x63D0;&#x4F9B;&#x4E86;&#x65B0;&#x65B9;&#x6CD5;&#x548C;&#x65B0;&#x6280;&#x672F;, &#x4F46;&#x4F9D;&#x7136;&#x79BB;&#x4EBA;&#x7C7B;&#x7684;&#x8BED;&#x8A00;&#x7406;&#x89E3;&#x548C;&#x8868;&#x8FBE;&#x80FD;&#x529B;&#x6709;&#x8D28;&#x7684;&#x5DEE;&#x8DDD;&#x3002;&#x4EE3;&#x8868;&#x6027;&#x7684;&#x5DE5;&#x4F5C;&#x662F;&#x5FAE;&#x8F6F;&#x7684;Tay&#x673A;&#x5668;&#x4EBA;&#xFF0C;&#x53EF;&#x60DC;&#x4E0A;&#x7EBF;&#x5B66;&#x4E60;&#x540E;&#xFF0C;&#x5F88;&#x5FEB;&#x5C31;&#x88AB;&#x7F51;&#x53CB;&#x6559;&#x574F;&#x4E86;&#x3002;&#x4F46;&#x662F;&#x5B66;&#x672F;&#x4E0A;&#x4E3A;&#x7279;&#x5B9A;&#x4EFB;&#x52A1;&#x7684;&#x804A;&#x5929;&#x673A;&#x5668;&#x4EBA;&#x63D0;&#x4F9B;&#x4E86;&#x5F88;&#x591A;&#x6846;&#x67B6;&#xFF0C;&#x5305;&#x62EC;&#x57FA;&#x4E8E;&#x751F;&#x6210;&#x6A21;&#x578B;&#xFF0C;&#x57FA;&#x4E8E;&#x589E;&#x5F3A;&#x5B66;&#x4E60;&#xFF0C;&#x57FA;&#x4E8E;&#x6A21;&#x677F;&#xFF0C;&#x57FA;&#x4E8E;&#x68C0;&#x7D22;&#x7684;&#x65B9;&#x6CD5;&#x3002;<br><img src="/2016/08/13/chat-bot/tay.png" alt="logo"><br>&#x5546;&#x4E1A;&#x5E94;&#x7528;&#x4E0A;&#xFF0C;&#x5E0C;&#x671B;&#x804A;&#x5929;&#x673A;&#x5668;&#x4EBA;&#x80FD;&#x591F;&#x7406;&#x89E3;&#x4EBA;&#x7684;&#x9700;&#x6C42;&#xFF0C;&#x63D0;&#x4F9B;&#x8BED;&#x8A00;&#x4EA4;&#x4E92;&#xFF0C;&#x5B8C;&#x6210;&#x4E00;&#x5B9A;&#x4EFB;&#x52A1;&#x3002;<br>&#x5F00;&#x653E;&#x57DF;&#x7684;&#x4EFB;&#x52A1;&#xFF0C;&#x8981;&#x6C42;&#x804A;&#x5929;&#x673A;&#x5668;&#x4EBA;&#x50CF;&#x4EBA;&#x4E00;&#x6837;&#x65E0;&#x6240;&#x4E0D;&#x77E5;&#xFF0C;&#x5C5E;&#x4E8E;&#x5F3A;&#x4EBA;&#x5DE5;&#x667A;&#x80FD;&#xFF0C;&#x76EE;&#x524D;&#x5B66;&#x672F;&#x7406;&#x8BBA;&#x8FD8;&#x8FDC;&#x8FBE;&#x4E0D;&#x5230;&#x8FD9;&#x4E9B;&#x6C34;&#x5E73;&#x3002;&#x5728;&#x81EA;&#x7136;&#x8BED;&#x8A00;&#x7406;&#x89E3;&#x548C;&#x751F;&#x6210;&#x5916;&#xFF0C;&#x8FD8;&#x6709;&#x8BB0;&#x5FC6;&#x3001;&#x63A8;&#x7406;&#x7B49;&#x9700;&#x8981;&#x5B66;&#x672F;&#x652F;&#x6301;&#x3002;<br><img src="/2016/08/13/chat-bot/nlp.jpg" alt="logo"><br>&#x5C01;&#x95ED;&#x57DF;&#x7684;&#x4EFB;&#x52A1;&#xFF0C;&#x8981;&#x6C42;&#x804A;&#x5929;&#x673A;&#x5668;&#x4EBA;&#x5B8C;&#x6210;&#x4E00;&#x4E2A;&#x7279;&#x5B9A;&#x7684;&#x4EFB;&#x52A1;&#xFF0C;&#x5982;&#x667A;&#x80FD;&#x6295;&#x8D44;&#x987E;&#x95EE;&#x3001;&#x9910;&#x9986;&#x8BA2;&#x9910;&#x673A;&#x5668;&#x4EBA;&#x3002;&#x8FD9;&#x4E9B;&#x65B9;&#x9762;&#x7684;&#x673A;&#x5668;&#x4EBA;&#x5DF2;&#x57FA;&#x672C;&#x5177;&#x5907;&#x7406;&#x8BBA;&#x652F;&#x6301;&#x3002;<br>&#x90A3;&#x4E48;&#x5C01;&#x95ED;&#x57DF;&#x4E0A;&#x7684;&#x804A;&#x5929;&#x673A;&#x5668;&#x4EBA;&#xFF0C;&#x5728;&#x5546;&#x4E1A;&#x843D;&#x5730;&#x4E0A;&#x53C8;&#x6709;&#x4EC0;&#x4E48;&#x6BD4;&#x8F83;&#x597D;&#x7684;&#x6A21;&#x5F0F;&#x5462;&#xFF1F;<br>&#x4FE1;&#x606F;&#x4EA7;&#x4E1A;&#x91CC;&#x6A21;&#x5F0F;&#x4E00;&#x822C;&#x5206;&#x4E3A;&#x9488;&#x5BF9;&#x4F01;&#x4E1A;&#x7AEF;(ToB), &#x9488;&#x5BF9;&#x6D88;&#x8D39;&#x8005;&#x7AEF;(ToC)&#x3002;<br>ToB&#x578B;&#x4E00;&#x822C;&#x9700;&#x8981;&#x6839;&#x636E;&#x516C;&#x53F8;&#x4E1A;&#x52A1;&#x5B9A;&#x5236;&#x4EFB;&#x52A1;&#xFF0C;&#x6536;&#x96C6;&#x6570;&#x636E;&#xFF0C;&#x6BD4;&#x8F83;&#x96BE;&#x5FEB;&#x901F;&#x6210;&#x957F;&#x3002;<br>ToC&#x578B;&#xFF0C;&#x5373;&#x5411;&#x5927;&#x4F17;&#x6D88;&#x8D39;&#x8005;&#x63D0;&#x4F9B;&#x670D;&#x52A1;&#xFF0C;&#x5177;&#x6709;&#x5927;&#x9762;&#x79EF;&#x7684;&#x53D7;&#x4F17;&#xFF0C;&#x6F5C;&#x529B;&#x8F83;&#x5927;&#x3002;&#x540C;&#x65F6;&#xFF0C;&#x5982;&#x679C;&#x73B0;&#x6709;ToC&#x7684;&#x6D88;&#x8D39;&#x8005;&#x4EA7;&#x54C1;&#xFF0C;&#x518D;&#x642D;&#x8F7D;&#x804A;&#x5929;&#x673A;&#x5668;&#x4EBA;&#x4F1A;&#x6709;&#x4E8B;&#x534A;&#x529F;&#x500D;&#x7684;&#x6548;&#x679C;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x8682;&#x8681;&#x91D1;&#x670D;&#x5728;&#x652F;&#x4ED8;&#x5B9D;&#x91CC;&#x642D;&#x8F7D;&#x8BED;&#x97F3;&#x52A9;&#x624B;&#xFF0C;&#x540E;&#x7EED;&#x53EF;&#x80FD;&#x8FD8;&#x6709;&#x667A;&#x80FD;&#x6295;&#x8D44;&#x987E;&#x95EE;&#x3002;&#x5FAE;&#x8F6F;&#x5728;Office&#x8F6F;&#x4EF6;&#x91CC;&#x642D;&#x8F7D;&#x804A;&#x5929;&#x673A;&#x5668;&#x4EBA;&#xFF0C;&#x4E5F;&#x6709;&#x63D0;&#x5347;&#x7528;&#x6237;&#x4F53;&#x9A8C;&#x7684;&#x6548;&#x679C;&#x3002;&#x5F53;&#x7136;&#x4E5F;&#x53EF;&#x4EE5;&#x9769;&#x65B0;&#x4E00;&#x4E9B;&#x5782;&#x76F4;&#x9886;&#x57DF;&#x7684;app, &#x505A;&#x51FA;&#x8033;&#x76EE;&#x4E00;&#x65B0;&#x7684;&#x4EA7;&#x54C1;&#x3002;</p>
]]></content>
    
    <summary type="html">
    
      &lt;p&gt;2016&amp;#x5E74;&amp;#x804A;&amp;#x5929;&amp;#x673A;&amp;#x5668;&amp;#x4EBA;&amp;#x76F8;&amp;#x5173;&amp;#x521B;&amp;#x4E1A;&amp;#x548C;&amp;#x65B0;&amp;#x95FB;&amp;#x5C42;&amp;#x51FA;&amp;#x4E0D;&amp;#x7A77;&amp;#x3002;&amp;#x5B66;&amp;#x672F;&amp;#x652F;&amp;#x6491;&amp;#x548C;&amp;#x5546;&amp;#x4E1A;&amp;#x6A21;&amp;#x5F0F;&amp;#x90FD;&amp;#x6709;&amp;#x54EA;&amp;#x4E9B;&amp;#x53EF;&amp;#x884C;&amp;#x57DF;&amp;#x5462;&amp;#xFF1F;&lt;br&gt;&lt;/p&gt;
    
    </summary>
    
    
  </entry>
  
  <entry>
    <title>自动驾驶离我们还有多远?</title>
    <link href="https://omgteam.github.io/2016/08/13/auto-car/"/>
    <id>https://omgteam.github.io/2016/08/13/auto-car/</id>
    <published>2016-08-13T02:24:25.000Z</published>
    <updated>2016-08-13T04:00:23.000Z</updated>
    
    <content type="html"><![CDATA[<p>&#x73AF;&#x5883;&#x611F;&#x77E5;&#xFF0C;&#x89C4;&#x5212;&#x51B3;&#x7B56;&#x662F;&#x81EA;&#x52A8;&#x9A7E;&#x9A76;&#x7684;&#x91CD;&#x8981;&#x90E8;&#x5206;&#x3002;&#x4E0B;&#x9762;&#x4ECE;&#x5B66;&#x672F;&#x548C;&#x5DE5;&#x4E1A;&#x7684;&#x89D2;&#x5EA6;&#x770B;&#x770B;&#x81EA;&#x52A8;&#x9A7E;&#x9A76;&#x79BB;&#x6211;&#x4EEC;&#x5230;&#x5E95;&#x8FD8;&#x6709;&#x591A;&#x8FDC;&#x3002;<br><a id="more"></a><br>&#x673A;&#x5668;&#x611F;&#x77E5;&#x8FD1;&#x51E0;&#x5E74;&#x5728;&#x5B66;&#x672F;&#x4E0A;&#x6709;&#x91CD;&#x5927;&#x7A81;&#x7834;&#x3002;&#x4E3B;&#x8981;&#x8D21;&#x732E;&#x6765;&#x81EA;&#x4E8E;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x5728;&#x8BA1;&#x7B97;&#x673A;&#x89C6;&#x89C9;&#x4E0A;&#x7684;&#x7A81;&#x7834;&#x3002;&#x4EE3;&#x8868;&#x6027;&#x5DE5;&#x4F5C;&#x662F;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x5728;ImageNet 1000&#x7C7B;&#x7269;&#x4F53;&#x5206;&#x7C7B;&#x7CBE;&#x5EA6;&#x8D85;&#x8D8A;&#x4EBA;&#x7C7B;&#x7684;&#x8BC6;&#x522B;&#x7CBE;&#x5EA6;&#x3002;<br>&#x5728;&#x611F;&#x77E5;&#x4E4B;&#x540E;&#xFF0C;&#x7531;&#x611F;&#x77E5;&#x5230;&#x51B3;&#x7B56;&#x4E5F;&#x53D6;&#x5F97;&#x91CD;&#x5927;&#x5B66;&#x672F;&#x8FDB;&#x5C55;&#x3002;&#x4E3B;&#x8981;&#x8D21;&#x732E;&#x6765;&#x81EA;&#x4E8E;&#x6DF1;&#x5EA6;&#x589E;&#x5F3A;&#x5B66;&#x4E60;&#x7684;&#x5E94;&#x7528;&#x3002;&#x4EE3;&#x8868;&#x6027;&#x5DE5;&#x4F5C;&#x662F;Google DeepMind&#x56E2;&#x961F;&#x8BBE;&#x8BA1;&#x7684;&#x673A;&#x5668;&#x4EBA;&#x5728;&#x6E38;&#x620F;(Atari games), &#x56F4;&#x68CB;(Alpha Go)&#x4E0A;&#x76F8;&#x7EE7;&#x53D6;&#x5F97;&#x60CA;&#x4EBA;&#x6210;&#x7EE9;&#xFF0C;&#x5728;Nature&#x4E0A;&#x53D1;&#x8868;&#x91CD;&#x91CF;&#x7EA7;&#x8BBA;&#x6587;&#x3002;<br><img src="/2016/08/13/auto-car/drl.jpg" alt="logo"><br>&#x7531;&#x8FD9;&#x4E9B;&#x5B66;&#x672F;&#x4E0A;&#x7684;&#x65B0;&#x5143;&#x7D20;&#x548C;&#x4F20;&#x7EDF;&#x7684;&#x611F;&#x77E5;&#x3001;&#x89C4;&#x5212;&#x51B3;&#x7B56;&#x65B9;&#x6CD5;&#x914D;&#x5408;&#xFF0C;&#x81EA;&#x52A8;&#x9A7E;&#x9A76;&#x5728;&#x7406;&#x8BBA;&#x4E0A;&#x53EF;&#x884C;&#x6027;&#x5927;&#x5E45;&#x63D0;&#x9AD8;&#x3002;</p>
<p>&#x6240;&#x4EE5;&#xFF0C;&#x6211;&#x4EEC;&#x770B;&#x5230;&#x8FD9;&#x4E24;&#x5E74;&#x5728;&#x5DE5;&#x4E1A;&#x754C;&#xFF0C;&#x81EA;&#x52A8;&#x9A7E;&#x9A76;&#x516C;&#x53F8;&#x7EB7;&#x7EB7;&#x6D8C;&#x73B0;&#x3002;&#x8FD9;&#x5176;&#x4E2D;&#x5305;&#x62EC;Google, &#x767E;&#x5EA6;&#x7B49;&#x5DE8;&#x5934;&#x516C;&#x53F8;, &#x4E5F;&#x5305;&#x62EC;&#x9A6D;&#x52BF;&#x79D1;&#x6280;&#x3001;&#x5730;&#x5E73;&#x7EBF;&#x673A;&#x5668;&#x4EBA;&#x7B49;&#x521B;&#x4E1A;&#x516C;&#x53F8;&#x3002;<br><img src="/2016/08/13/auto-car/gcar.jpeg" alt="logo"><br>&#x4ECE;&#x8FD9;&#x4E9B;&#x516C;&#x53F8;&#x7684;&#x5B9E;&#x8DF5;&#x5F62;&#x5F0F;&#x770B;&#xFF0C;&#x5927;&#x81F4;&#x5206;&#x4E3A;2&#x6761;&#x8DEF;&#x7EBF;&#xFF1A;</p>
<h2 id="1&#xFF0C;&#x4ECE;&#x9A7E;&#x9A76;&#x8F85;&#x52A9;&#x7CFB;&#x7EDF;&#x5230;&#x81EA;&#x52A8;&#x9A7E;&#x9A76;&#x7CFB;&#x7EDF;&#x3002;"><a href="#1&#xFF0C;&#x4ECE;&#x9A7E;&#x9A76;&#x8F85;&#x52A9;&#x7CFB;&#x7EDF;&#x5230;&#x81EA;&#x52A8;&#x9A7E;&#x9A76;&#x7CFB;&#x7EDF;&#x3002;" class="headerlink" title="1&#xFF0C;&#x4ECE;&#x9A7E;&#x9A76;&#x8F85;&#x52A9;&#x7CFB;&#x7EDF;&#x5230;&#x81EA;&#x52A8;&#x9A7E;&#x9A76;&#x7CFB;&#x7EDF;&#x3002;"></a>1&#xFF0C;&#x4ECE;&#x9A7E;&#x9A76;&#x8F85;&#x52A9;&#x7CFB;&#x7EDF;&#x5230;&#x81EA;&#x52A8;&#x9A7E;&#x9A76;&#x7CFB;&#x7EDF;&#x3002;</h2><p>&#x5373;&#x5148;&#x4FDD;&#x5B88;&#x5730;&#x5148;&#x5229;&#x7528;&#x673A;&#x5668;&#x611F;&#x77E5;&#x6280;&#x672F;&#x7684;&#x7A81;&#x7834;&#xFF0C;&#x589E;&#x5F3A;&#x53F8;&#x673A;&#x7684;&#x73AF;&#x5883;&#x611F;&#x77E5;&#x80FD;&#x529B;&#x3002;&#x7136;&#x540E;&#x79EF;&#x7D2F;&#x66F4;&#x591A;&#x6570;&#x636E;&#x3001;&#x66F4;&#x591A;&#x7ECF;&#x9A8C;&#x505A;&#x81EA;&#x52A8;&#x9A7E;&#x9A76;&#x7CFB;&#x7EDF;&#x3002;<br>&#x9A7E;&#x9A76;&#x8F85;&#x52A9;&#x7CFB;&#x7EDF;&#x7684;&#x52A3;&#x52BF;&#x5728;&#x4E8E;&#x4E0D;&#x80FD;&#x771F;&#x6B63;&#x5B9E;&#x73B0;&#x4EBA;&#x529B;&#x89E3;&#x653E;&#x548C;&#x8F66;&#x8F86;&#x5171;&#x4EAB;&#x3002;<br>&#x5730;&#x5E73;&#x7EBF;&#x673A;&#x5668;&#x4EBA;&#x7B49;&#x5F88;&#x591A;&#x5BB6;&#x516C;&#x53F8;&#x5DF2;&#x7ECF;&#x63A8;&#x51FA;&#x9A7E;&#x9A76;&#x8F85;&#x52A9;&#x7CFB;&#x7EDF;&#xFF0C;&#x6216;&#x7C7B;&#x4F3C;&#x4EA7;&#x54C1;&#xFF08;&#x50CF;&#x81EA;&#x52A8;&#x5DE1;&#x822A;&#xFF09;&#x3002;</p>
<h2 id="2&#xFF0C;&#x4ECE;&#x5C40;&#x90E8;&#x81EA;&#x52A8;&#x9A7E;&#x9A76;&#x5230;&#x5168;&#x5C40;&#x81EA;&#x52A8;&#x9A7E;&#x9A76;&#x3002;"><a href="#2&#xFF0C;&#x4ECE;&#x5C40;&#x90E8;&#x81EA;&#x52A8;&#x9A7E;&#x9A76;&#x5230;&#x5168;&#x5C40;&#x81EA;&#x52A8;&#x9A7E;&#x9A76;&#x3002;" class="headerlink" title="2&#xFF0C;&#x4ECE;&#x5C40;&#x90E8;&#x81EA;&#x52A8;&#x9A7E;&#x9A76;&#x5230;&#x5168;&#x5C40;&#x81EA;&#x52A8;&#x9A7E;&#x9A76;&#x3002;"></a>2&#xFF0C;&#x4ECE;&#x5C40;&#x90E8;&#x81EA;&#x52A8;&#x9A7E;&#x9A76;&#x5230;&#x5168;&#x5C40;&#x81EA;&#x52A8;&#x9A7E;&#x9A76;&#x3002;</h2><p>&#x5373;&#x4ECE;&#x7279;&#x5B9A;&#x533A;&#x57DF;&#x6216;&#x7279;&#x5B9A;&#x573A;&#x666F;&#x81EA;&#x52A8;&#x9A7E;&#x9A76;&#x5230;&#x5168;&#x8DEF;&#x51B5;&#x5168;&#x5929;&#x5019;&#x81EA;&#x52A8;&#x9A7E;&#x9A76;&#x3002;&#x50CF;&#x5DF4;&#x58EB;&#x81EA;&#x52A8;&#x9A7E;&#x9A76;&#xFF0C;&#x516C;&#x56ED;&#x5185;&#x81EA;&#x52A8;&#x9A7E;&#x9A76;&#x7B49;&#x3002;<br>&#x9A6D;&#x52BF;&#x79D1;&#x6280;&#x7B49;&#x516C;&#x53F8;&#x91C7;&#x7528;&#x8FD9;&#x7C7B;&#x8DEF;&#x7EBF;&#x3002;</p>
<p>&#x90A3;&#x4E48;&#xFF0C;&#x81EA;&#x52A8;&#x9A7E;&#x9A76;&#x79BB;&#x6211;&#x4EEC;&#x8FD8;&#x6709;&#x591A;&#x8FDC;?<br>&#x5404;&#x5927;&#x516C;&#x53F8;&#x7ED9;&#x51FA;&#x7684;&#x65F6;&#x95F4;&#x57FA;&#x672C;&#x5728;2020&#x5E74;&#x4EE5;&#x524D;&#x3002;&#x5728;&#x5DE5;&#x4E1A;&#x754C;&#xFF0C;&#x73B0;&#x5728;&#x6709;&#x4E00;&#x5927;&#x6279;&#x65F6;&#x52BF;&#x82F1;&#x96C4;&#x52A0;&#x5165;&#x8FD9;&#x4E2A;&#x9886;&#x57DF;&#x3002;&#x5728;&#x5B66;&#x672F;&#x754C;&#xFF0C;&#x9876;&#x7EA7;&#x5B66;&#x672F;&#x7814;&#x7A76;&#x56E2;&#x961F;&#x4E5F;&#x8FD8;&#x5728;&#x4E0D;&#x65AD;&#x5B8C;&#x5584;&#x4ECE;&#x611F;&#x77E5;&#x5230;&#x63A7;&#x5236;&#x7684;&#x5404;&#x4E2A;&#x7EC6;&#x8282;&#x3002;&#x5C24;&#x5176;&#x5370;&#x8C61;&#x6DF1;&#x523B;&#x7684;&#x8FD8;&#x662F;Google DeepMind&#x56E2;&#x961F;&#x7684;&#x5B66;&#x672F;&#x8FDB;&#x5C55;&#xFF0C;&#x5728;&#x4EBA;&#x5DE5;&#x667A;&#x80FD;&#x9876;&#x4F1A;&#x4E0A;&#x6709;&#x8FDE;&#x7EED;&#x7684;&#x91CD;&#x8981;&#x8BBA;&#x6587;&#x4EA7;&#x51FA;&#xFF0C;&#x4E00;&#x70B9;&#x70B9;&#x57AB;&#x5B9E;&#x7406;&#x8BBA;&#x57FA;&#x7840;&#x3002;<br>&#x81EA;&#x52A8;&#x9A7E;&#x9A76;&#x5B9E;&#x73B0;&#x4E4B;&#x540E;&#xFF0C;&#x4F1A;&#x7ED9;&#x6211;&#x4EEC;&#x5E26;&#x6765;&#x4EC0;&#x4E48;&#x6837;&#x7684;&#x4FBF;&#x5229;&#xFF1F;&#x9664;&#x4E86;&#x89E3;&#x653E;&#x4EBA;&#x529B;&#x5916;&#xFF0C;&#x8FD8;&#x53EF;&#x4EE5;&#x5171;&#x4EAB;&#x8F66;&#x8F86;&#xFF0C;&#x7F13;&#x89E3;&#x62E5;&#x5835;&#x3002;&#x8F66;&#x8D39;&#x4E5F;&#x4F1A;&#x964D;!<br>&#x50CF;&#x6BD4;&#x5C14;.&#x76D6;&#x8328;&#x5728;2000&#x5E74;&#x5DE6;&#x53F3;&#x7684;CES&#x5927;&#x4F1A;&#x4E0A;&#x63F6;&#x63C4;&#x6C7D;&#x8F66;&#x884C;&#x4E1A;&#xFF0C;&#x201C;&#x5982;&#x679C;&#x901A;&#x7528;&#xFF08;&#x6C7D;&#x8F66;&#xFF09;&#x7684;&#x53D1;&#x5C55;&#x80FD;&#x50CF;&#x8BA1;&#x7B97;&#x673A;&#x884C;&#x4E1A;&#x4E00;&#x6837;&#x7684;&#x8BDD;&#xFF0C;&#x90A3;&#x4ECA;&#x5929;&#x4EBA;&#x4EBA;&#x90FD;&#x80FD;&#x5F00;&#x7740;&#x4EC5;&#x552E;25&#x7F8E;&#x5143;&#x7684;&#x6C7D;&#x8F66;&#xFF0C;&#x800C;&#x4E14;&#x4E00;&#x52A0;&#x4ED1;&#x6C7D;&#x6CB9;&#x53EF;&#x4EE5;&#x8DD1;1000&#x82F1;&#x91CC;&#x3002;&#x201D;</p>
]]></content>
    
    <summary type="html">
    
      &lt;p&gt;&amp;#x73AF;&amp;#x5883;&amp;#x611F;&amp;#x77E5;&amp;#xFF0C;&amp;#x89C4;&amp;#x5212;&amp;#x51B3;&amp;#x7B56;&amp;#x662F;&amp;#x81EA;&amp;#x52A8;&amp;#x9A7E;&amp;#x9A76;&amp;#x7684;&amp;#x91CD;&amp;#x8981;&amp;#x90E8;&amp;#x5206;&amp;#x3002;&amp;#x4E0B;&amp;#x9762;&amp;#x4ECE;&amp;#x5B66;&amp;#x672F;&amp;#x548C;&amp;#x5DE5;&amp;#x4E1A;&amp;#x7684;&amp;#x89D2;&amp;#x5EA6;&amp;#x770B;&amp;#x770B;&amp;#x81EA;&amp;#x52A8;&amp;#x9A7E;&amp;#x9A76;&amp;#x79BB;&amp;#x6211;&amp;#x4EEC;&amp;#x5230;&amp;#x5E95;&amp;#x8FD8;&amp;#x6709;&amp;#x591A;&amp;#x8FDC;&amp;#x3002;&lt;br&gt;&lt;/p&gt;
    
    </summary>
    
    
  </entry>
  
  <entry>
    <title>Key Idea of Deep Learning</title>
    <link href="https://omgteam.github.io/2016/08/06/key-dl/"/>
    <id>https://omgteam.github.io/2016/08/06/key-dl/</id>
    <published>2016-08-06T03:43:51.000Z</published>
    <updated>2016-08-06T03:43:51.000Z</updated>
    
    <content type="html"><![CDATA[<p>The key idea of deep learning is to design appropriate neural network to guide information flow and information transformation.</p>
<a id="more"></a>
<h2 id="Information-flow"><a href="#Information-flow" class="headerlink" title="Information flow"></a>Information flow</h2><h3 id="Integration-of-multiple-information-source"><a href="#Integration-of-multiple-information-source" class="headerlink" title="Integration of multiple information source"></a>Integration of multiple information source</h3><h3 id="Crossed-layer-or-time-step-information-flow"><a href="#Crossed-layer-or-time-step-information-flow" class="headerlink" title="Crossed layer or time-step information flow"></a>Crossed layer or time-step information flow</h3><h2 id="Information-transformation"><a href="#Information-transformation" class="headerlink" title="Information transformation"></a>Information transformation</h2><h3 id="Experience-based-transformation"><a href="#Experience-based-transformation" class="headerlink" title="Experience based transformation"></a>Experience based transformation</h3><h3 id="Task-oriented-transformation"><a href="#Task-oriented-transformation" class="headerlink" title="Task-oriented transformation"></a>Task-oriented transformation</h3>]]></content>
    
    <summary type="html">
    
      &lt;p&gt;The key idea of deep learning is to design appropriate neural network to guide information flow and information transformation.&lt;/p&gt;
    
    </summary>
    
    
  </entry>
  
  <entry>
    <title>Hello World</title>
    <link href="https://omgteam.github.io/2016/08/06/hello-world/"/>
    <id>https://omgteam.github.io/2016/08/06/hello-world/</id>
    <published>2016-08-06T03:42:18.000Z</published>
    <updated>2016-08-06T03:42:18.000Z</updated>
    
    <content type="html"><![CDATA[<p>Welcome to <a href="https://hexo.io/" target="_blank" rel="external">Hexo</a>! This is your very first post. Check <a href="https://hexo.io/docs/" target="_blank" rel="external">documentation</a> for more info. If you get any problems when using Hexo, you can find the answer in <a href="https://hexo.io/docs/troubleshooting.html" target="_blank" rel="external">troubleshooting</a> or you can ask me on <a href="https://github.com/hexojs/hexo/issues" target="_blank" rel="external">GitHub</a>.</p>
<a id="more"></a>
<h2 id="Quick-Start"><a href="#Quick-Start" class="headerlink" title="Quick Start"></a>Quick Start</h2><h3 id="Create-a-new-post"><a href="#Create-a-new-post" class="headerlink" title="Create a new post"></a>Create a new post</h3><figure class="highlight bash"><table><tr><td class="gutter"><pre><div class="line">1</div></pre></td><td class="code"><pre><div class="line">$ hexo new <span class="string">&quot;My New Post&quot;</span></div></pre></td></tr></table></figure>
<p>More info: <a href="https://hexo.io/docs/writing.html" target="_blank" rel="external">Writing</a></p>
<h3 id="Run-server"><a href="#Run-server" class="headerlink" title="Run server"></a>Run server</h3><figure class="highlight bash"><table><tr><td class="gutter"><pre><div class="line">1</div></pre></td><td class="code"><pre><div class="line">$ hexo server</div></pre></td></tr></table></figure>
<p>More info: <a href="https://hexo.io/docs/server.html" target="_blank" rel="external">Server</a></p>
<h3 id="Generate-static-files"><a href="#Generate-static-files" class="headerlink" title="Generate static files"></a>Generate static files</h3><figure class="highlight bash"><table><tr><td class="gutter"><pre><div class="line">1</div></pre></td><td class="code"><pre><div class="line">$ hexo generate</div></pre></td></tr></table></figure>
<p>More info: <a href="https://hexo.io/docs/generating.html" target="_blank" rel="external">Generating</a></p>
<h3 id="Deploy-to-remote-sites"><a href="#Deploy-to-remote-sites" class="headerlink" title="Deploy to remote sites"></a>Deploy to remote sites</h3><figure class="highlight bash"><table><tr><td class="gutter"><pre><div class="line">1</div></pre></td><td class="code"><pre><div class="line">$ hexo deploy</div></pre></td></tr></table></figure>
<p>More info: <a href="https://hexo.io/docs/deployment.html" target="_blank" rel="external">Deployment</a></p>
]]></content>
    
    <summary type="html">
    
      &lt;p&gt;Welcome to &lt;a href=&quot;https://hexo.io/&quot;&gt;Hexo&lt;/a&gt;! This is your very first post. Check &lt;a href=&quot;https://hexo.io/docs/&quot;&gt;documentation&lt;/a&gt; for more info. If you get any problems when using Hexo, you can find the answer in &lt;a href=&quot;https://hexo.io/docs/troubleshooting.html&quot;&gt;troubleshooting&lt;/a&gt; or you can ask me on &lt;a href=&quot;https://github.com/hexojs/hexo/issues&quot;&gt;GitHub&lt;/a&gt;.&lt;/p&gt;
    
    </summary>
    
    
  </entry>
  
</feed>
