<!DOCTYPE HTML>
<html>
<head>
  <meta charset="utf-8">
  
  <title>Junlong Liu</title>
  <meta name="author" content="Junlong Liu">

  
  

  <link rel="alternate" href="/atom.xml" title="Junlong Liu" type="application/atom+xml">
  <link rel="stylesheet" href="/css/style.css" media="screen" type="text/css">
  <!--[if lt IE 9]><script src="//html5shiv.googlecode.com/svn/trunk/html5.js"></script><![endif]-->
  <script src="//ajax.googleapis.com/ajax/libs/jquery/1.8/jquery.min.js"></script>
  
</head>

<body>
  <header id="header" class="inner"><nav>
  <ul>
    
      <li><a href="/">Home</a></li>
    
      <li><a href="/archives">Archives</a></li>
    
      <li><a href="/about">About</a></li>
    
  </ul>
</nav></header>
  <div id="content" class="inner">
  <article class="post">
  
    <div class="gallery">
  <div class="photoset">
    
      <img src="">
    
  </div>
  <div class="control">
    <div class="prev"></div>
    <div class="next"></div>
  </div>
</div>
  
  <header>
    
  
    <h1 class="title"><a href="/2017/04/19/motion-planning-review/">车辆运动预测方法调研报告</a></h1>
  

    <time datetime="2017-04-19T02:05:47.000Z">
  <span class="day">19</span><span class="month">Apr</span>
</time>
  </header>
  <div class="entry-content">
    
      <p>&#x6458;&#x8981;&#xFF1A;&#x8F66;&#x8F86;&#x8FD0;&#x52A8;&#x9884;&#x6D4B;&#x5BF9;&#x667A;&#x80FD;&#x9A7E;&#x9A76;&#x548C;&#x81EA;&#x52A8;&#x9A7E;&#x9A76;&#x6709;&#x91CD;&#x8981;&#x610F;&#x4E49;&#x3002;&#x5728;&#x8FD9;&#x7BC7;&#x62A5;&#x544A;&#x91CC;&#xFF0C;&#x5C06;&#x7B80;&#x8981;&#x4ECB;&#x7ECD;&#x4ECE;&#x4E0D;&#x540C;&#x62BD;&#x8C61;&#x5C42;&#x6B21;(&#x57FA;&#x4E8E;&#x7269;&#x7406;,&#x57FA;&#x4E8E;&#x64CD;&#x4F5C;,&#x57FA;&#x4E8E;&#x4EA4;&#x4E92;)&#xFF0C;&#x4E0D;&#x540C;&#x65F6;&#x95F4;&#x8DE8;&#x5EA6;(&#x6BEB;&#x79D2;,&#x79D2;,&#x5206;&#x949F;)&#x7684;&#x76F8;&#x5173;&#x5B66;&#x672F;&#x5DE5;&#x4F5C;&#xFF0C;&#x5E76;&#x5728;&#x57FA;&#x4E8E;&#x610F;&#x5411;&#x8FA8;&#x522B;&#x548C;&#x98CE;&#x9669;&#x8BC4;&#x4F30;&#x7684;&#x8FD0;&#x52A8;&#x9884;&#x6D4B;&#x6A21;&#x578B;&#x627E;&#x5230;&#x5404;&#x5DE5;&#x4F5C;&#x5BF9;&#x5E94;&#x7684;&#x95EE;&#x9898;&#x8303;&#x7574;&#x3002;&#x6700;&#x540E;&#x62A5;&#x544A;&#x521D;&#x6B65;&#x8BA8;&#x8BBA;&#x8BE5;&#x8FD0;&#x52A8;&#x9884;&#x6D4B;&#x6A21;&#x578B;&#x7684;&#x521D;&#x6B65;&#x65B9;&#x6848;&#x548C;&#x5C40;&#x9650;&#x6027;&#x3002;</p>
<h1 id="&#x76EE;&#x5F55;"><a href="#&#x76EE;&#x5F55;" class="headerlink" title="&#x76EE;&#x5F55;"></a>&#x76EE;&#x5F55;</h1><p>1.&#x80CC;&#x666F;    </p>
<ol>
<li>&#x8F66;&#x8F86;&#x8FD0;&#x52A8;&#x9884;&#x6D4B;&#x6A21;&#x578B;<br>2.1 &#x4E0D;&#x540C;&#x62BD;&#x8C61;&#x5C42;&#x6B21;&#x7684;&#x8FD0;&#x52A8;&#x9884;&#x6D4B;<br>2.1.1&#x57FA;&#x4E8E;&#x7269;&#x7406;&#x7684;&#x8FD0;&#x52A8;&#x9884;&#x6D4B;&#x6A21;&#x578B;<br>2.1.2 &#x57FA;&#x4E8E;&#x64CD;&#x4F5C;&#x7684;&#x8FD0;&#x52A8;&#x9884;&#x6D4B;&#x6A21;&#x578B;<br>2.1.3 &#x57FA;&#x4E8E;&#x4EA4;&#x4E92;&#x7684;&#x8FD0;&#x52A8;&#x9884;&#x6D4B;&#x6A21;&#x578B;<br>2.2 &#x57FA;&#x4E8E;&#x4E0D;&#x540C;&#x65F6;&#x95F4;&#x8DE8;&#x5EA6;&#x7684;&#x8FD0;&#x52A8;&#x9884;&#x6D4B;&#x6A21;&#x578B;    </li>
<li>&#x8FD0;&#x52A8;&#x9884;&#x6D4B;&#x6A21;&#x578B;&#x7684;&#x521D;&#x6B65;&#x65B9;&#x6848;&#x4E0E;&#x5C40;&#x9650;&#x6027;<br>3.1&#x521D;&#x6B65;&#x65B9;&#x6848;<br>3.2 &#x521D;&#x6B65;&#x65B9;&#x6848;&#x7684;&#x5C40;&#x9650;&#x6027;    </li>
<li>&#x53C2;&#x8003;&#x6587;&#x732E;(<a href="https://pan.baidu.com/s/1c21HEI8" target="_blank" rel="external">https://pan.baidu.com/s/1c21HEI8</a>)    </li>
</ol>
<h1 id="1-&#x80CC;&#x666F;"><a href="#1-&#x80CC;&#x666F;" class="headerlink" title="1.&#x80CC;&#x666F;"></a>1.&#x80CC;&#x666F;</h1><p>&#x8F66;&#x8F86;&#x8FD0;&#x52A8;&#x9884;&#x6D4B;&#x95EE;&#x9898;&#x662F;&#x7ED9;&#x5B9A;&#x8F66;&#x8F86;&#x72B6;&#x6001;&#x548C;&#x73AF;&#x5883;(&#x5305;&#x542B;&#x5176;&#x4ED6;&#x8F66;&#x8F86;&#x72B6;&#x6001;&#x3001;&#x7EA2;&#x7EFF;&#x706F;&#x3001;&#x884C;&#x4EBA;&#x3001;&#x9053;&#x8DEF;&#x60C5;&#x51B5;&#x7B49;&#x7B49;)&#xFF0C;&#x5224;&#x65AD;&#x672A;&#x6765;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x5185;&#x8F66;&#x8F86;&#x7684;&#x8FD0;&#x52A8;&#x8F68;&#x8FF9;&#x3002;<br>&#x8F66;&#x8F86;&#x8FD0;&#x52A8;&#x9884;&#x6D4B;&#x95EE;&#x9898;&#x7684;&#x96BE;&#x70B9;&#xFF1A;<br>1&#xFF0C;    &#x53F8;&#x673A;&#x7684;&#x611F;&#x77E5;&#x8F93;&#x5165;&#x56E0;&#x4EBA;&#x800C;&#x5DF2;&#x3001;&#x56E0;&#x72B6;&#x6001;&#x800C;&#x5F02;&#x3002;&#x611F;&#x77E5;&#x8F93;&#x5165;&#x5305;&#x542B;&#x89C6;&#x89C9;&#x3001;&#x542C;&#x89C9;&#x7B49;&#xFF0C;&#x6CE8;&#x610F;&#x529B;&#x5206;&#x5E03;&#x4E0D;&#x540C;&#xFF0C;&#x968F;&#x673A;&#x56E0;&#x7D20;&#x5927;&#xFF1B;<br>2&#xFF0C;    &#x53F8;&#x673A;&#x7684;&#x64CD;&#x4F5C;&#x548C;&#x98CE;&#x9669;&#x8BC4;&#x4F30;&#x4E0D;&#x6EE1;&#x8DB3;&#x7406;&#x6027;&#x4EBA;&#x5047;&#x8BBE;&#x3002;&#x6709;&#x53EF;&#x80FD;&#x6709;&#x8BEF;&#x64CD;&#x4F5C;&#x548C;&#x8BEF;&#x5224;&#x65AD;&#xFF1B;<br>3&#xFF0C;    &#x8F66;&#x8F86;&#x76F8;&#x4E92;&#x4E4B;&#x95F4;&#x7684;&#x610F;&#x5411;&#x548C;&#x8FD0;&#x52A8;&#x9884;&#x5224;&#x4F1A;&#x5F71;&#x54CD;&#x5404;&#x81EA;&#x8FD0;&#x52A8;&#x51B3;&#x7B56;&#x548C;&#x8DEF;&#x5F84;&#x89C4;&#x5212;&#x3002;</p>
<ol>
<li>&#x8F66;&#x8F86;&#x8FD0;&#x52A8;&#x9884;&#x6D4B;&#x6A21;&#x578B;<br>&#x8F66;&#x8F86;&#x8FD0;&#x52A8;&#x51B3;&#x7B56;&#x4E3B;&#x8981;&#x5305;&#x542B;&#x4E24;&#x4E2A;&#x8981;&#x7D20;&#xFF1A;&#x610F;&#x5411;&#x4E0E;&#x98CE;&#x9669;&#x8BC4;&#x4F30;&#x3002;&#x4ECE;&#x957F;&#x5230;&#x77ED;&#x7684;&#x65F6;&#x95F4;&#x8DE8;&#x5EA6;&#xFF0C;&#x610F;&#x5411;&#x53EF;&#x4EE5;&#x662F;&#x76EE;&#x7684;&#x5730;&#xFF1B;&#x6B63;&#x524D;&#x65B9;&amp;&#x5DE6;&#x8F6C;&amp;&#x53F3;&#x8F6C;&#x7B49;&#xFF1B;&#x53D8;&#x9053;&amp;&#x52A0;&#x901F;&amp;&#x51CF;&#x901F;&#x7B49;&#x3002;&#x8212;&#x9002;&#x548C;&#x5B89;&#x5168;&#x4E5F;&#x662F;&#x610F;&#x5411;&#x7684;&#x6F5C;&#x5728;&#x56E0;&#x5B50;&#x3002;&#x98CE;&#x9669;&#x8BC4;&#x4F30;&#x5305;&#x542B;&#x78B0;&#x649E;&#x3001;&#x8FDD;&#x89C4;&#x7B49;&#x98CE;&#x9669;&#x3002;&#x4E00;&#x822C;&#x5730;&#xFF0C;&#x8F66;&#x8F86;&#x5148;&#x6709;&#x610F;&#x5411;&#xFF0C;&#x7136;&#x540E;&#x8BC4;&#x4F30;&#x610F;&#x5411;&#x76F8;&#x5173;&#x7684;&#x8DEF;&#x7EBF;&#x89C4;&#x5212;&#x98CE;&#x9669;&#xFF0C;&#x8FDB;&#x800C;&#x91C7;&#x53D6;&#x64CD;&#x4F5C;&#xFF0C;&#x5F71;&#x54CD;&#x8F66;&#x8F86;&#x8FD0;&#x52A8;&#xFF0C;&#x5982;&#x56FE; 1&#x6240;&#x793A;&#x3002;</li>
</ol>
<p><img src="/2017/04/19/motion-planning-review/1.png" alt="logo"><br>&#x56FE; 1&#x57FA;&#x4E8E;&#x610F;&#x5411;&#x548C;&#x98CE;&#x9669;&#x8BC4;&#x4F30;&#x7684;&#x8FD0;&#x52A8;&#x9884;&#x6D4B;&#x4F9D;&#x8D56;&#x56FE;&#x3002;Operational, Tactical, Strategic&#x662F;&#x5BF9;&#x64CD;&#x4F5C;&#x7684;&#x65F6;&#x95F4;&#x8DE8;&#x5EA6;&#x7684;&#x5206;&#x7C7B;[2],&#x5206;&#x522B;&#x4E3A;&#x767E;&#x6BEB;&#x79D2;&#x7EA7;(&#x4F8B;&#x5982;&#x52A0;&#x901F;,&#x6253;&#x65B9;&#x5411;&#x76D8;)&#xFF0C;&#x79D2;&#x7EA7;&#x548C;&#x79D2;&#x7EA7;&#x4EE5;&#x4E0A;(&#x540E;&#x4E24;&#x8005;&#x53EF;&#x4EE5;&#x662F;Operational Maneuvers&#x7684;&#x7EC4;&#x5408;)&#x3002;</p>
<h2 id="2-1-&#x4E0D;&#x540C;&#x62BD;&#x8C61;&#x5C42;&#x6B21;&#x7684;&#x8FD0;&#x52A8;&#x9884;&#x6D4B;"><a href="#2-1-&#x4E0D;&#x540C;&#x62BD;&#x8C61;&#x5C42;&#x6B21;&#x7684;&#x8FD0;&#x52A8;&#x9884;&#x6D4B;" class="headerlink" title="2.1 &#x4E0D;&#x540C;&#x62BD;&#x8C61;&#x5C42;&#x6B21;&#x7684;&#x8FD0;&#x52A8;&#x9884;&#x6D4B;"></a>2.1 &#x4E0D;&#x540C;&#x62BD;&#x8C61;&#x5C42;&#x6B21;&#x7684;&#x8FD0;&#x52A8;&#x9884;&#x6D4B;</h2><p>[1] &#x4E2D;&#x5C06;&#x5DF2;&#x6709;&#x5DE5;&#x4F5C;&#x5212;&#x5206;&#x6210;3&#x4E2A;&#x62BD;&#x8C61;&#x5C42;&#x6B21;&#xFF0C;&#x5982;&#x56FE; 2&#x6240;&#x793A;&#xFF0C;&#x5206;&#x4E3A;&#x57FA;&#x4E8E;&#x7269;&#x7406;&#x7684;&#x3001;&#x57FA;&#x4E8E;&#x64CD;&#x4F5C;&#x7684;&#x3001;&#x57FA;&#x4E8E;&#x4EA4;&#x4E92;&#x7684;&#x6A21;&#x578B;&#x3002;</p>
<p><img src="/2017/04/19/motion-planning-review/2.png" alt="logo"></p>
<p>&#x56FE; 2&#x4E0D;&#x540C;&#x62BD;&#x8C61;&#x5C42;&#x6B21;&#x7684;&#x8FD0;&#x52A8;&#x9884;&#x6D4B;&#x6A21;&#x578B;&#x8BF4;&#x660E;[1]&#x3002;</p>
<p><img src="/2017/04/19/motion-planning-review/3.png" alt="logo"></p>
<p>&#x56FE; 3&#x4E0D;&#x540C;&#x62BD;&#x8C61;&#x5C42;&#x6B21;&#x7684;&#x8FD0;&#x52A8;&#x9884;&#x6D4B;&#x6A21;&#x578B;&#x5728;&#x57FA;&#x4E8E;&#x610F;&#x5411;&#x548C;&#x98CE;&#x9669;&#x8BC4;&#x4F30;&#x6A21;&#x578B;&#x91CC;&#x7684;&#x5BF9;&#x5E94;&#x5B50;&#x7ED3;&#x6784;&#x3002;&#x6CE8;&#xFF1A;&#x4E24;&#x8005;&#x4E0D;&#x5B8C;&#x5168;&#x5BF9;&#x5E94;&#xFF0C;&#x6709;&#x7684;&#x7C7B;&#x522B;&#x65B9;&#x6CD5;&#x53EA;&#x6D89;&#x53CA;&#x5B50;&#x7ED3;&#x6784;&#x91CC;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x3002;</p>
<h3 id="2-1-1&#x57FA;&#x4E8E;&#x7269;&#x7406;&#x7684;&#x8FD0;&#x52A8;&#x9884;&#x6D4B;&#x6A21;&#x578B;"><a href="#2-1-1&#x57FA;&#x4E8E;&#x7269;&#x7406;&#x7684;&#x8FD0;&#x52A8;&#x9884;&#x6D4B;&#x6A21;&#x578B;" class="headerlink" title="2.1.1&#x57FA;&#x4E8E;&#x7269;&#x7406;&#x7684;&#x8FD0;&#x52A8;&#x9884;&#x6D4B;&#x6A21;&#x578B;"></a>2.1.1&#x57FA;&#x4E8E;&#x7269;&#x7406;&#x7684;&#x8FD0;&#x52A8;&#x9884;&#x6D4B;&#x6A21;&#x578B;</h3><p>&#x57FA;&#x4E8E;&#x7269;&#x7406;&#x7684;&#x6A21;&#x578B;&#x53EA;&#x8003;&#x8651;&#x5F53;&#x524D;&#x5404;&#x7269;&#x4F53;&#x72B6;&#x6001;&#xFF08;&#x901F;&#x5EA6;&#x3001;&#x52A0;&#x901F;&#x5EA6;&#x3001;&#x8DEF;&#x51B5;&#x7B49;&#xFF09;&#x8FDB;&#x884C;&#x4E9A;&#x79D2;&#x7EA7;&#x7684;&#x8FD0;&#x52A8;&#x9884;&#x6D4B;&#x3002;&#x53C8;&#x5305;&#x62EC;&#x57FA;&#x4E8E;&#x8FD0;&#x52A8;&#x5B66;&#x548C;&#x57FA;&#x4E8E;&#x52A8;&#x6001;&#x6A21;&#x578B;&#x7684;&#x65B9;&#x6CD5;&#x3002;&#x5982;&#x56FE; 3&#x6240;&#x793A;&#xFF0C;&#x8BE5;&#x65B9;&#x6CD5;&#x5373;&#x4ECE;&#x7269;&#x7406;&#x89C4;&#x5F8B;(Laws)&#x548C;&#x8DEF;&#x5F62;&#x8DEF;&#x51B5;(Environment)&#x9884;&#x6D4B;&#x8FD0;&#x52A8;&#x8DEF;&#x5F84;(Motion)&#x3002;<br>&#x57FA;&#x4E8E;&#x8FD0;&#x52A8;&#x5B66;&#x89C4;&#x5F8B;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x53EA;&#x8003;&#x8651;&#x8F66;&#x8F86;&#x7684;&#x4F4D;&#x7F6E;&#xFF0C;&#x901F;&#x5EA6;&#xFF0C;(&#x89D2;)&#x52A0;&#x901F;&#x5EA6;&#x8FDB;&#x884C;&#x6C42;&#x89E3;&#x3002;[3]&#x4E2D;&#x5BF9;&#x8BE5;&#x7C7B;&#x65B9;&#x6CD5;&#x8FDB;&#x884C;&#x4E86;&#x8C03;&#x7814;&#x548C;&#x6BD4;&#x8F83;&#x3002;&#x5BF9;&#x4E8E;&#x8FD0;&#x52A8;&#x8DEF;&#x5F84;&#x7684;&#x4E0D;&#x786E;&#x5B9A;&#x6027;&#xFF0C;&#x53EF;&#x4EE5;&#x91C7;&#x7528;&#x9AD8;&#x65AF;&#x566A;&#x97F3;&#x5047;&#x8BBE;(Kalman Filter)&#xFF0C;&#x6216;&#x8005;Monte Carlo&#x6A21;&#x62DF;(&#x8003;&#x8651;&#x8DEF;&#x5F62;&#x8DEF;&#x51B5;&#x9650;&#x5236;)&#x3002;<br>&#x57FA;&#x4E8E;&#x52A8;&#x6001;&#x6A21;&#x578B;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x8003;&#x8651;&#x4E86;&#x5404;&#x79CD;&#x5F71;&#x54CD;&#x8FD0;&#x52A8;&#x7684;&#x529B;&#x5B66;&#x56E0;&#x7D20;&#xFF0C;&#x9700;&#x8981;&#x8BF8;&#x591A;&#x8F66;&#x8F86;&#x5185;&#x90E8;&#x53C2;&#x6570;&#xFF0C;&#x4E0D;&#x9002;&#x7528;&#x4E8E;&#x5176;&#x4ED6;&#x8F66;&#x8F86;&#x7684;&#x8FD0;&#x52A8;&#x9884;&#x6D4B;&#x3002;</p>
<h3 id="2-1-2-&#x57FA;&#x4E8E;&#x64CD;&#x4F5C;&#x7684;&#x8FD0;&#x52A8;&#x9884;&#x6D4B;&#x6A21;&#x578B;"><a href="#2-1-2-&#x57FA;&#x4E8E;&#x64CD;&#x4F5C;&#x7684;&#x8FD0;&#x52A8;&#x9884;&#x6D4B;&#x6A21;&#x578B;" class="headerlink" title="2.1.2 &#x57FA;&#x4E8E;&#x64CD;&#x4F5C;&#x7684;&#x8FD0;&#x52A8;&#x9884;&#x6D4B;&#x6A21;&#x578B;"></a>2.1.2 &#x57FA;&#x4E8E;&#x64CD;&#x4F5C;&#x7684;&#x8FD0;&#x52A8;&#x9884;&#x6D4B;&#x6A21;&#x578B;</h3><p>&#x57FA;&#x4E8E;&#x64CD;&#x4F5C;&#x7684;&#x6A21;&#x578B;&#x5047;&#x8BBE;&#x5404;&#x8F66;&#x8F86;&#x7684;&#x64CD;&#x4F5C;&#x76F8;&#x4E92;&#x72EC;&#x7ACB;&#xFF0C;&#x5404;&#x81EA;&#x6839;&#x636E;&#x610F;&#x5411;&#x89C4;&#x5212;&#x64CD;&#x4F5C;&#x548C;&#x8FD0;&#x52A8;&#x8F68;&#x8FF9;&#xFF0C;&#x5982;&#x56FE; 3&#x6240;&#x793A;&#x3002;&#x4E3B;&#x8981;&#x5206;&#x4E3A;&#x57FA;&#x4E8E;&#x539F;&#x578B;&#x5339;&#x914D;&#x548C;&#x57FA;&#x4E8E;&#x610F;&#x5411;&#x8BC6;&#x522B;&#x5E76;&#x6267;&#x884C;&#x7684;&#x65B9;&#x6CD5;&#x3002;<br>&#x57FA;&#x4E8E;&#x539F;&#x578B;&#x5339;&#x914D;&#x6839;&#x636E;&#x73B0;&#x6709;&#x8DEF;&#x5F84;&#x5339;&#x914D;&#x8DEF;&#x5F84;&#x539F;&#x578B;&#x3002;&#x8BE5;&#x65B9;&#x6CD5;&#x5C06;&#x64CD;&#x4F5C;&#x4F5C;&#x4E3A;&#x9690;&#x85CF;&#x4FE1;&#x606F;&#xFF0C;&#x76F4;&#x63A5;&#x5BF9;&#x53EF;&#x89C2;&#x5BDF;&#x7684;&#x8FD0;&#x52A8;&#x8F68;&#x8FF9;&#x5EFA;&#x6A21;&#x5339;&#x914D;&#x3002;&#x505A;&#x6CD5;&#x662F;&#x4E8B;&#x5148;&#x5BF9;&#x4E0D;&#x540C;&#x8DEF;&#x5F62;&#x91CC;&#x8F66;&#x8F86;&#x8FD0;&#x52A8;&#x8F68;&#x8FF9;&#x805A;&#x7C7B;[4]&#x5E76;&#x751F;&#x6210;&#x6A21;&#x5F0F;&#xFF0C;&#x7136;&#x540E;&#x4F7F;&#x7528;&#x65F6;&#x5BF9;&#x8F66;&#x8F86;&#x7684;&#x8F68;&#x8FF9;&#x8FDB;&#x884C;&#x6A21;&#x5F0F;&#x5339;&#x914D;&#x3002;&#x6A21;&#x5F0F;&#x7684;&#x8868;&#x793A;&#x6709;&#x5F88;&#x591A;&#x76F8;&#x5173;&#x5DE5;&#x4F5C;&#xFF0C;&#x57FA;&#x4E8E;&#x8DEF;&#x5F84;&#x7684;[5,6]&#xFF0C;&#x57FA;&#x4E8E;HMM(Hidden Markov Model)&#x7684;[7]&#xFF0C;&#x57FA;&#x4E8E;&#x9AD8;&#x65AF;&#x8FC7;&#x7A0B;&#x7684;[8-10]&#x3002;&#x4E3B;&#x8981;&#x7F3A;&#x70B9;&#x662F;&#x5BF9;&#x4E8E;&#x4E0D;&#x540C;&#x8DEF;&#x5F62;&#x8DEF;&#x51B5;&#x6709;&#x4E0D;&#x540C;&#x7684;&#x8F68;&#x8FF9;&#x6A21;&#x5F0F;&#xFF0C;&#x5E76;&#x4E14;&#x9700;&#x8981;&#x4E8B;&#x5148;&#x8BA1;&#x7B97;&#x3002;<br>&#x57FA;&#x4E8E;&#x610F;&#x5411;&#x8BC6;&#x522B;&#x5E76;&#x6267;&#x884C;&#x7684;&#x65B9;&#x6CD5;&#x9996;&#x5148;&#x8BC6;&#x522B;&#x8F66;&#x8F86;&#x7684;&#x610F;&#x5411;&#xFF0C;&#x518D;&#x9884;&#x6D4B;&#x8FD0;&#x52A8;&#x8F68;&#x8FF9;&#x3002;&#x610F;&#x5411;&#x8BC6;&#x522B;&#x5DE5;&#x4F5C;&#x5305;&#x62EC;Multi-layer Perception [11], Logistic Regression [12], Relevance Vector Machine [13], Support Vector Machine [14-16], &#x4EE5;&#x53CA;&#x5C06;Intention-Maneuver&#x8FDB;&#x884C;HMM&#x5EFA;&#x6A21;[17-19]&#x3002;&#x610F;&#x5411;&#x786E;&#x5B9A;&#x540E;&#xFF0C;&#x76F8;&#x5E94;&#x7684;&#x64CD;&#x4F5C;&#x4E5F;&#x786E;&#x5B9A;&#xFF0C;&#x7531;&#x6B64;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x8FD0;&#x52A8;&#x5B66;&#x6A21;&#x578B;&#x5F97;&#x5230;&#x786E;&#x5B9A;&#x8DEF;&#x5F84;[20]&#xFF0C;&#x6216;&#x9AD8;&#x65AF;&#x8FC7;&#x7A0B;&#x5EFA;&#x6A21;&#x4EE5;&#x8003;&#x8651;&#x4E0D;&#x786E;&#x5B9A;&#x6027;[21]&#xFF0C;&#x6216;&#x8005;&#x91C7;&#x6837;&#x65B9;&#x6CD5;&#x5F97;&#x5230;&#x52A8;&#x6001;&#x53EF;&#x884C;&#x8F68;&#x8FF9;&#x96C6;&#x5408;[14]&#x3002;&#x9664;&#x4E86;&#x8F68;&#x8FF9;&#x9884;&#x6D4B;&#x5916;&#xFF0C;&#x53E6;&#x4E00;&#x79CD;&#x66FF;&#x4EE3;&#x65B9;&#x6CD5;&#x5B9A;&#x4E49;&#x4E86;stochastic reachable set[22],  &#x7528;&#x4EE5;&#x5B9A;&#x4E49;&#x53EF;&#x80FD;&#x7684;&#x672A;&#x6765;&#x4F4D;&#x7F6E;&#x6982;&#x7387;&#x5206;&#x5E03;&#x3002;</p>
<h3 id="2-1-3-&#x57FA;&#x4E8E;&#x4EA4;&#x4E92;&#x7684;&#x8FD0;&#x52A8;&#x9884;&#x6D4B;&#x6A21;&#x578B;"><a href="#2-1-3-&#x57FA;&#x4E8E;&#x4EA4;&#x4E92;&#x7684;&#x8FD0;&#x52A8;&#x9884;&#x6D4B;&#x6A21;&#x578B;" class="headerlink" title="2.1.3 &#x57FA;&#x4E8E;&#x4EA4;&#x4E92;&#x7684;&#x8FD0;&#x52A8;&#x9884;&#x6D4B;&#x6A21;&#x578B;"></a>2.1.3 &#x57FA;&#x4E8E;&#x4EA4;&#x4E92;&#x7684;&#x8FD0;&#x52A8;&#x9884;&#x6D4B;&#x6A21;&#x578B;</h3><p>&#x57FA;&#x4E8E;&#x4EA4;&#x4E92;&#x7684;&#x8FD0;&#x52A8;&#x6A21;&#x578B;&#x9884;&#x6D4B;&#x8003;&#x8651;&#x4E86;&#x8F66;&#x8F86;&#x4E0E;&#x73AF;&#x5883;&#x4E4B;&#x95F4;&#x76F8;&#x4E92;&#x5F71;&#x54CD;&#xFF0C;&#x5373;&#x7ED3;&#x5408;&#x98CE;&#x9669;&#x8BC4;&#x4F30;(&#x4E3B;&#x8981;&#x662F;&#x78B0;&#x649E;&#x5047;&#x8BBE;)&#x8FDB;&#x884C;&#x8DEF;&#x7EBF;&#x9884;&#x6D4B;&#x3002;&#x4E3B;&#x8981;&#x5206;&#x4E3A;&#x57FA;&#x4E8E;&#x539F;&#x578B;&#x7684;&#x548C;&#x57FA;&#x4E8E;&#x52A8;&#x6001;&#x8D1D;&#x53F6;&#x65AF;&#x7F51;&#x7EDC;&#x7684;&#x65B9;&#x6CD5;&#x3002;<br>&#x57FA;&#x4E8E;&#x539F;&#x578B;&#x7684;&#x65B9;&#x6CD5;&#x5728;2.1.2&#x91CC;&#x57FA;&#x4E8E;&#x539F;&#x578B;&#x7684;&#x65B9;&#x6CD5;&#x57FA;&#x7840;&#x4E0A;&#x89C4;&#x907F;&#x4E86;&#x5BB9;&#x6613;&#x9020;&#x6210;&#x78B0;&#x649E;&#x7684;&#x8DEF;&#x7EBF;&#xFF0C;&#x5373;&#x8FD0;&#x52A8;&#x9884;&#x6D4B;&#x9075;&#x4ECE;&#x5047;&#x8BBE;&#xFF1A;&#x8F66;&#x8F86;&#x6709;&#x907F;&#x514D;&#x78B0;&#x649E;&#x7684;&#x504F;&#x597D;[23,24]&#x3002;<br>&#x57FA;&#x4E8E;&#x52A8;&#x6001;&#x8D1D;&#x53F6;&#x65AF;&#x7F51;&#x7EDC;&#x7684;&#x65B9;&#x6CD5;&#x5305;&#x62EC;&#x57FA;&#x4E8E;pairwise&#x76F8;&#x4E92;&#x5F71;&#x54CD;&#x7684;Coupled HMM [25,26]&#xFF0C;&#x57FA;&#x4E8E;&#x5C40;&#x90E8;&#x73AF;&#x5883;&#x7684;[27-31]&#x3002;</p>
<h2 id="2-2-&#x57FA;&#x4E8E;&#x4E0D;&#x540C;&#x65F6;&#x95F4;&#x8DE8;&#x5EA6;&#x7684;&#x8FD0;&#x52A8;&#x9884;&#x6D4B;&#x6A21;&#x578B;"><a href="#2-2-&#x57FA;&#x4E8E;&#x4E0D;&#x540C;&#x65F6;&#x95F4;&#x8DE8;&#x5EA6;&#x7684;&#x8FD0;&#x52A8;&#x9884;&#x6D4B;&#x6A21;&#x578B;" class="headerlink" title="2.2 &#x57FA;&#x4E8E;&#x4E0D;&#x540C;&#x65F6;&#x95F4;&#x8DE8;&#x5EA6;&#x7684;&#x8FD0;&#x52A8;&#x9884;&#x6D4B;&#x6A21;&#x578B;"></a>2.2 &#x57FA;&#x4E8E;&#x4E0D;&#x540C;&#x65F6;&#x95F4;&#x8DE8;&#x5EA6;&#x7684;&#x8FD0;&#x52A8;&#x9884;&#x6D4B;&#x6A21;&#x578B;</h2><p>&#x57FA;&#x4E8E;&#x6BEB;&#x79D2;&#xFF0C;&#x79D2;&#xFF0C;&#x79D2;&#x7EA7;&#x4EE5;&#x4E0A;&#x53EF;&#x4EE5;&#x5C06;&#x8F66;&#x8F86;&#x64CD;&#x4F5C;&#x5212;&#x5206;&#x4E3A;Operational / Tactic / Strategic Maneuvers[2,32]&#x3002;&#x9884;&#x6D4B;&#x64CD;&#x4F5C;&#x540E;&#x5373;&#x53EF;&#x9884;&#x6D4B;&#x8F66;&#x8F86;&#x8FD0;&#x52A8;&#x8F68;&#x8FF9;&#x3002;&#x5BF9;&#x5E94;&#x57FA;&#x4E8E;&#x610F;&#x5411;&#x548C;&#x98CE;&#x9669;&#x8BC4;&#x4F30;&#x9884;&#x6D4B;&#x6A21;&#x578B;&#x91CC;&#x7684;Maneuvers&#x63A8;&#x5BFC;Motion&#x3002;<br>Operational maneuvers, &#x6307;&#x5728;&#x767E;&#x6BEB;&#x79D2;&#x7EA7;&#x522B;&#x7684;&#x64CD;&#x4F5C;&#xFF0C;&#x5982;&#x8E29;&#x6CB9;&#x95E8;&#x3001;&#x6253;&#x65B9;&#x5411;&#x76D8;&#x7B49;&#x3002;<br>Tactical maneuvers, &#x6307;&#x5728;&#x79D2;&#x7EA7;&#x522B;&#x7684;&#x64CD;&#x4F5C;&#xFF0C;&#x5982;&#x53D8;&#x9053;&#x3001;&#x8F6C;&#x5F2F;&#x7B49;&#x3002;[2]&#x5BF9;&#x8BE5;&#x7C7B;&#x5DE5;&#x4F5C;&#x8FDB;&#x884C;&#x4E86;&#x8C03;&#x7814;&#xFF0C;&#x5C06;Tactical maneuvers&#x5206;&#x4E3A;&#x5355;&#x76EE;&#x6807;&#x548C;&#x591A;&#x76EE;&#x6807;&#x65B9;&#x6CD5;&#x3002;&#x5355;&#x76EE;&#x6807;&#x65B9;&#x6CD5;&#x5C06;&#x76EE;&#x6807;&#x8BBE;&#x4E3A;&#x53D8;&#x9053;&#x3001;&#x8F6C;&#x5F2F;&#x3001;&#x5236;&#x52A8;&#x7B49;&#x3002;&#x5177;&#x4F53;&#x5DE5;&#x4F5C;&#x4EE5;&#x53CA;&#x5728;[2]&#x4E2D;&#x7684;&#x53C2;&#x8003;&#x6587;&#x732E;&#x89C1;&#x56FE; 4&#x3002;&#x591A;&#x76EE;&#x6807;&#x65B9;&#x6CD5;&#x8003;&#x8651;&#x5355;&#x76EE;&#x6807;&#x91CC;&#x7684;&#x591A;&#x4E2A;&#x76EE;&#x6807;&#x7EC4;&#x5408;&#x3002;&#x5177;&#x4F53;&#x5DE5;&#x4F5C;&#x4EE5;&#x53CA;&#x5728;[2]&#x4E2D;&#x7684;&#x53C2;&#x8003;&#x6587;&#x732E;&#x89C1;&#x56FE; 5&#x3002;<br>Strategic maneuvers, &#x6307;&#x5728;&#x5206;&#x949F;&#x751A;&#x81F3;&#x79D2;&#x7EA7;&#x522B;&#x7684;&#x64CD;&#x4F5C;&#xFF0C;&#x5982;&#x66F4;&#x5FEB;&#x3001;&#x66F4;&#x8212;&#x9002;&#x5230;&#x8FBE;&#x76EE;&#x7684;&#x5730;&#x3002;</p>
<p><img src="/2017/04/19/motion-planning-review/4.png" alt="logo"></p>
<p>&#x56FE; 4 Operational Maneuvers&#x91CC;&#x5355;&#x76EE;&#x6807;&#x65B9;&#x6CD5;&#x7684;&#x53C2;&#x8003;&#x6587;&#x732E;[2]&#xFF0C;&#x76EE;&#x6807;&#x8BBE;&#x5B9A;&#xFF0C;&#x8F93;&#x5165;&#x8F93;&#x51FA;&#x3002;</p>
<p><img src="/2017/04/19/motion-planning-review/5.png" alt="logo"></p>
<p>&#x56FE; 5 Operational Maneuvers&#x91CC;&#x591A;&#x76EE;&#x6807;&#x65B9;&#x6CD5;&#x7684;&#x53C2;&#x8003;&#x6587;&#x732E;[2]&#xFF0C;&#x76EE;&#x6807;&#x8BBE;&#x5B9A;&#xFF0C;&#x8F93;&#x5165;&#x8F93;&#x51FA;&#x3002;</p>
<h1 id="3-&#x8FD0;&#x52A8;&#x9884;&#x6D4B;&#x6A21;&#x578B;&#x7684;&#x521D;&#x6B65;&#x65B9;&#x6848;&#x4E0E;&#x5C40;&#x9650;&#x6027;"><a href="#3-&#x8FD0;&#x52A8;&#x9884;&#x6D4B;&#x6A21;&#x578B;&#x7684;&#x521D;&#x6B65;&#x65B9;&#x6848;&#x4E0E;&#x5C40;&#x9650;&#x6027;" class="headerlink" title="3. &#x8FD0;&#x52A8;&#x9884;&#x6D4B;&#x6A21;&#x578B;&#x7684;&#x521D;&#x6B65;&#x65B9;&#x6848;&#x4E0E;&#x5C40;&#x9650;&#x6027;"></a>3. &#x8FD0;&#x52A8;&#x9884;&#x6D4B;&#x6A21;&#x578B;&#x7684;&#x521D;&#x6B65;&#x65B9;&#x6848;&#x4E0E;&#x5C40;&#x9650;&#x6027;</h1><p>&#x8FD9;&#x91CC;&#x7ED9;&#x51FA;&#x57FA;&#x4E8E;&#x610F;&#x5411;&#x8FA8;&#x522B;&#x548C;&#x98CE;&#x9669;&#x8BC4;&#x4F30;&#x7684;&#x8FD0;&#x52A8;&#x9884;&#x6D4B;&#x6A21;&#x578B;&#x7684;&#x521D;&#x6B65;&#x65B9;&#x6848;&#xFF0C;&#x5E76;&#x8BA8;&#x8BBA;&#x5C40;&#x9650;&#x6027;&#x3002;</p>
<h2 id="3-1&#x521D;&#x6B65;&#x65B9;&#x6848;"><a href="#3-1&#x521D;&#x6B65;&#x65B9;&#x6848;" class="headerlink" title="3.1&#x521D;&#x6B65;&#x65B9;&#x6848;"></a>3.1&#x521D;&#x6B65;&#x65B9;&#x6848;</h2><p>&#x9996;&#x5148;&#xFF0C;&#x8BC6;&#x522B;&#x6240;&#x6709;&#x8F66;&#x8F86;&#x7684;&#x610F;&#x5411;&#xFF0C;&#x7ED3;&#x5408;&#x5176;&#x73B0;&#x5728;&#x8FD0;&#x52A8;&#x72B6;&#x6001;(&#x4F4D;&#x7F6E;&#xFF0C;&#x901F;&#x5EA6;&#xFF0C;&#x52A0;&#x901F;&#x5EA6;)&#x548C;&#x4EA4;&#x901A;&#x89C4;&#x5219;&#xFF0C;&#x8BA1;&#x7B97;&#x521D;&#x6B65;&#x8F68;&#x8FF9;&#x3002;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x8F66;&#x8F86;&#x7684;&#x8F6C;&#x5411;&#x706F;&#x3001;&#x8F66;&#x9053;&#x3001;&#x8FD0;&#x52A8;&#x8F68;&#x8FF9;&#x7B49;&#x5224;&#x65AD;&#x8F66;&#x8F86;&#x610F;&#x5411;&#x3002;&#x8F68;&#x8FF9;&#x8BA1;&#x7B97;&#x5728;&#x767E;&#x6BEB;&#x79D2;&#x7EA7;&#x522B;&#x53EF;&#x4EE5;&#x91C7;&#x7528;Kalman Filter&#xFF0C;&#x79D2;&#x7EA7;&#x548C;&#x79D2;&#x7EA7;&#x4EE5;&#x4E0A;&#x8003;&#x8651;2.1.2&#x4E2D;&#x57FA;&#x4E8E;&#x64CD;&#x4F5C;&#x7684;&#x8FD0;&#x52A8;&#x9884;&#x6D4B;&#x65B9;&#x6CD5;&#x3002;<br>&#x5176;&#x6B21;&#xFF0C;&#x904D;&#x5386;&#x6240;&#x6709;&#x8F66;&#x8F86;&#xFF0C;&#x6839;&#x636E;&#x4E0A;&#x8FF0;&#x7ED3;&#x679C;&#x8BA1;&#x7B97;&#x81EA;&#x8EAB;&#x8F66;&#x8F86;&#x9762;&#x4E34;&#x7684;&#x78B0;&#x649E;&#x98CE;&#x9669;&#xFF0C;&#x5E76;&#x4F18;&#x5316;&#x81EA;&#x8EAB;&#x8F68;&#x8FF9;&#x3002;[1]&#x5185;&#x63D0;&#x4F9B;&#x4E86;&#x78B0;&#x649E;&#x98CE;&#x9669;&#x8BA1;&#x7B97;&#x65B9;&#x6CD5;&#x8C03;&#x7814;&#x603B;&#x7ED3;&#x3002;&#x8F68;&#x8FF9;&#x7684;&#x4F18;&#x5316;&#x786E;&#x4FDD;&#x5728;&#x767E;&#x6BEB;&#x79D2;&#x7EA7;&#x522B;&#x5176;&#x4ED6;&#x8F66;&#x8F86;&#x8F68;&#x8FF9;&#x7684;&#x7A81;&#x53D8;&#x4E0D;&#x4F1A;&#x4EA7;&#x751F;&#x65B0;&#x7684;&#x78B0;&#x649E;&#x98CE;&#x9669;&#xFF0C;&#x5728;&#x79D2;&#x7EA7;&#x522B;&#x53D1;&#x751F;&#x78B0;&#x649E;&#x7684;&#x98CE;&#x9669;&#x4F4E;(&#x53F8;&#x673A;&#x7684;&#x53CD;&#x5E94;&#x548C;&#x5236;&#x52A8;&#x5728;&#x767E;&#x6BEB;&#x79D2;&#x7EA7;&#x522B;)&#x3002;&#x5E76;&#x4E14;&#x5728;&#x767E;&#x6BEB;&#x79D2;&#x95F4;&#x9694;&#x66F4;&#x65B0;&#x8F66;&#x8F86;&#x9884;&#x6D4B;&#x3002;</p>
<h2 id="3-2-&#x521D;&#x6B65;&#x65B9;&#x6848;&#x7684;&#x5C40;&#x9650;&#x6027;"><a href="#3-2-&#x521D;&#x6B65;&#x65B9;&#x6848;&#x7684;&#x5C40;&#x9650;&#x6027;" class="headerlink" title="3.2 &#x521D;&#x6B65;&#x65B9;&#x6848;&#x7684;&#x5C40;&#x9650;&#x6027;"></a>3.2 &#x521D;&#x6B65;&#x65B9;&#x6848;&#x7684;&#x5C40;&#x9650;&#x6027;</h2><p>1&#xFF0C;&#x8BE5;&#x65B9;&#x6848;&#x5FFD;&#x7565;&#x4E86;&#x5BF9;&#x8212;&#x9002;&#x5EA6;&#x56E0;&#x7D20;&#x5728;&#x53F8;&#x673A;&#x51B3;&#x7B56;&#x4E2D;&#x7684;&#x5F71;&#x54CD;&#x3002;&#x5728;&#x5B89;&#x5168;&#x56E0;&#x7D20;&#x5F97;&#x5230;&#x4FDD;&#x8BC1;&#x540E;&#xFF0C;&#x8212;&#x9002;&#x5EA6;&#x662F;&#x5F71;&#x54CD;&#x53F8;&#x673A;&#x8FDB;&#x884C;&#x8DEF;&#x5F84;&#x89C4;&#x5212;&#x7684;&#x91CD;&#x8981;&#x56E0;&#x7D20;&#xFF1B;<br>2&#xFF0C;&#x8BE5;&#x65B9;&#x6848;&#x5FFD;&#x7565;&#x4E86;&#x53F8;&#x673A;&#x7684;&#x611F;&#x77E5;&#x8F93;&#x5165;&#x7684;&#x4E0D;&#x540C;&#x3002;&#x53F8;&#x673A;&#x6709;&#x89C6;&#x89C9;&#x3001;&#x542C;&#x89C9;&#x3001;&#x89E6;&#x89C9;(&#x65B9;&#x5411;&#x76D8;&#x8F6C;&#x77E9;)&#x7B49;&#x8F93;&#x5165;&#xFF0C;&#x5E76;&#x53EF;&#x80FD;&#x5B58;&#x5728;&#x6CE8;&#x610F;&#x529B;&#x4E0D;&#x96C6;&#x4E2D;&#xFF0C;&#x969C;&#x788D;&#x7269;&#x906E;&#x6321;&#x7B49;&#x611F;&#x77E5;&#x5F31;&#x5316;&#x73B0;&#x8C61;&#xFF1B;<br>3&#xFF0C;&#x8BE5;&#x65B9;&#x6848;&#x5FFD;&#x7565;&#x4E86;&#x53F8;&#x673A;&#x7684;&#x64CD;&#x4F5C;&#x80FD;&#x529B;&#x548C;&#x98CE;&#x9669;&#x8BC4;&#x4F30;&#x80FD;&#x529B;&#x5DEE;&#x522B;&#xFF1B;<br>4&#xFF0C;&#x8BE5;&#x65B9;&#x6848;&#x5FFD;&#x7565;&#x4E86;&#x884C;&#x4EBA;&#x7684;&#x5F71;&#x54CD;&#x3002;</p>
<h1 id="4-&#x53C2;&#x8003;&#x6587;&#x732E;-https-pan-baidu-com-s-1c21HEI8"><a href="#4-&#x53C2;&#x8003;&#x6587;&#x732E;-https-pan-baidu-com-s-1c21HEI8" class="headerlink" title="4. &#x53C2;&#x8003;&#x6587;&#x732E;(https://pan.baidu.com/s/1c21HEI8)"></a>4. &#x53C2;&#x8003;&#x6587;&#x732E;(<a href="https://pan.baidu.com/s/1c21HEI8" target="_blank" rel="external">https://pan.baidu.com/s/1c21HEI8</a>)</h1><p>[1] Lef&#xE8;vre S, Vasquez D, Laugier C. A survey on motion prediction and risk assessment for intelligent vehicles[J]. Robomech Journal, 2014, 1(1): 1.<br>[2] Doshi A, Trivedi M M. Tactical driver behavior prediction and intent inference: A review[C]//2011 14th International IEEE Conference on Intelligent Transportation Systems (ITSC). IEEE, 2011: 1892-1897.<br>[3] Schubert R, Richter E, Wanielik G (2008) Comparison and evaluation of advanced motion models for vehicle tracking In: Proc. international conference on information fusion, pp 1&#x2013;6.<br>[4] Atev S, Miller G, Papanikolopoulos NP (2010) Clustering of vehicle trajectories. IEEE Trans on Intell Transportation Syst 11(3):647&#x2013;657.<br>[5] Vasquez D, Fraichard T (2004) Motion prediction for moving objects: a statistical approach In: Proc. IEEE international conference on robotics and automation, vol. 4, pp 3931&#x2013;3936<br>[6] Hermes C, Wohler C, Schenk K, Kummert F (2009) Long-term vehicle motion prediction In: Proc. IEEE intelligent vehicles symposium, pp 652&#x2013;657<br>[7] Vasquez D, Fraichard T, Laugier C (2009) Growing hidden markov models: an incremental tool for learning and predicting human and vehicle motion. Int J Robot Res 28(11-12):1486&#x2013;1506<br>[8] Joseph JM, Doshi-Velez F, Roy N (2010) A Bayesian nonparametric approach to modeling mobility patterns In: Proc. AAAI conference on artificial intelligence<br>[9] Aoude G, Joseph J, Roy N, How J (2011) Mobile agent trajectory prediction using Bayesian nonparametric reachability trees In: Proc. of AIAA Infotech@Aerospace, pp 1587&#x2013;1593<br>[10] Tran Q, Firl J (2014) Online maneuver recognition and multimodal trajectory prediction for intersection assistance using non-parametric regression In: Proc. IEEE Intelligent Vehicles Symposium, pp 918&#x2013;923<br>[11] Garcia-Ortiz M, Fritsch J, Kummert F, Gepperth A (2011) Behavior prediction at multiple time-scales in inner-city scenarios In: Proc. IEEE intelligent vehicles symposium, pp 1068&#x2013;1073<br>[12] Klingelschmitt S, Platho M, Gross H-M, Willert V, Eggert J (2014) Combining behavior and situation information for reliably estimating multiple intentions In: Proc. IEEE Intelligent Vehicles Symposium, pp 388&#x2013;393<br>[13] Morris B, Doshi A, Trivedi M (2011) Lane change intent prediction for driver assistance: on-road design and evaluation In: Proc. IEEE Intelligent Vehicles Symposium, pp 895&#x2013;901<br>[14] Aoude GS, Luders BD, Lee KKH, Levine DS, How JP (2010) Threat assessment design for driver assistance system at intersections In: Proc. IEEE intelligent transportation systems conference, pp 25&#x2013;30<br>[15] Kumar P, Perrollaz M, Lef<code>&#x2018;evre S, Laugier C (2013) Learning-based approach for online lane change intention prediction In: Proc. IEEE Intelligent Vehicles Symposium, pp 797&#x2013;802
[16] Mandalia HM, Salvucci DD (2005) Using support vector machines for lane change detection In: Proc. of the Human Factors and Ergonomics Society 49th Annual Meeting 
[17] Berndt H, Emmert J, Dietmayer K (2008) Continuous driver intention recognition with hidden Markov models In: Proc. IEEE intelligent transportation systems conference, pp 1189&#x2013;1194 
[18] Streubel T, Hoffmann KH (2014) Prediction of driver intended path at intersections In: Proc. IEEE Intelligent Vehicles Symposium, pp 134&#x2013;139
[19] Lef</code>&#x2018;evre S, Gao Y, Vasquez D, Tseng E, Bajcsy R, Borrelli F (2014) Lane keeping assistance with learning-based driver model and model predictive control In: Proc. 12th International Symposium on Advanced Vehicle Control<br>[20] Tamke A, Dang T, Breuel G (2011) A flexible method for criticality assessment in driver assistance systems In: Proc. IEEE intelligent vehicles symposium, pp 697&#x2013;702<br>[21] Laugier C, Paromtchik I, Perrollaz M, Yong M, Yoder JD, Tay C, Mekhnacha K, Negre A (2011) Probabilistic analysis of dynamic scenes and collision risks assessment to improve driving safety. IEEE Intell Transportation Syst Mag 3(4):4&#x2013;19<br>[22] Althoff M, Stursberg O, Buss M (2009) Model-based probabilistic collision detection in autonomous driving. IEEE Trans on Intell Transportation Syst 10(2):299&#x2013;310<br>[23] Kaefer E, Hermes C, Woehler C, Ritter H, Kummert F (2010) Recognition of situation classes at road intersections In: Proc. IEEE international conference on robotics and automation, pp 3960&#x2013;3965<br>[24] Lawitzky A, Althoff D, Passenberg CF, Tanzmeister G, Wollherr D, Buss M (2013) Interactive scene prediction for automotive applications In: Proc. IEEE Intelligent Vehicles Symposium, pp 1028&#x2013;1033<br>[25] Brand M, Oliver N, Pentland A (1997) Coupled hidden Markov models for complex action recognition In: Proc. IEEE conference on computer vision and pattern recognition, pp 994&#x2013;999<br>[26] Oliver N, Pentland AP (2000) Graphical models for driver behavior recognition in a SmartCar In: Proc. IEEE intelligent vehicles symposium, pp 7&#x2013;12<br>[27]Agamennoni G, Nieto JI, Nebot EM (2011) A Bayesian approach for driving behavior inference In: Proc. IEEE intelligent vehicles symposium, pp 595&#x2013;600<br>[28] Agamennoni G, Nieto JI, Nebot EM (2012) Estimation of multivehicle dynamics by considering contextual information. IEEE Trans on Robot 28(4):855&#x2013;870<br>[29] Lefe&#x300;vre S, Laugier C, Iban&#x303;ez-Guzma&#x301;n J (2012) Risk assessment at road intersections: comparing intention and expectation In: Proc. IEEE intelligent vehicles symposium, pp 165&#x2013;171<br>[30] Lefe&#x300;vre S, Laugier C, Iban&#x303;ez-Guzma&#x301;n J (2012) Evaluating risk at road intersections by detecting conflicting intentions In: Proc. IEEE/RSJ international conference on intelligent robots and systems, pp 4841&#x2013;4846<br>[31] Lefe&#x300;vre S, Laugier C, Iban&#x303;ez-Guzma&#x301;n J (2013) Intention-aware risk estimation for general traffic situations: application to intersection safety. Inria Research Report 8379<br>[32] M. Plochl and J. Edelmann, &#x201C;Driver models in automobile dynamics application,&#x201D; Vehicle System Dynamics, vol. 45, no. 7, pp. 699&#x2013;741, 2007.</p>

    
    
    <footer class="meta">
      
      
      
    </footer>
    
  </div>
  
</article>

  <article class="post">
  
    <div class="gallery">
  <div class="photoset">
    
      <img src="">
    
  </div>
  <div class="control">
    <div class="prev"></div>
    <div class="next"></div>
  </div>
</div>
  
  <header>
    
  
    <h1 class="title"><a href="/2017/04/19/BPL/">Slide about Human-level Concept Learning (Bayesian Program Learning)</a></h1>
  

    <time datetime="2017-04-19T01:38:41.000Z">
  <span class="day">19</span><span class="month">Apr</span>
</time>
  </header>
  <div class="entry-content">
    
      <p>Here is a detailed presentation about Science Paper Human-level concept learning through probabilistic program induction [1].</p>
<p>[1]Lake, Brenden M., Ruslan Salakhutdinov, and Joshua B. Tenenbaum. Human-level concept learning through probabilistic program induction. Science 350.6266 (2015): 1332-1338.</p>
<p><img src="/2017/04/19/BPL/BPL/BPL.001.jpeg" alt="logo"><br><img src="/2017/04/19/BPL/BPL/BPL.002.jpeg" alt="logo"><br><img src="/2017/04/19/BPL/BPL/BPL.003.jpeg" alt="logo"><br><img src="/2017/04/19/BPL/BPL/BPL.004.jpeg" alt="logo"><br><img src="/2017/04/19/BPL/BPL/BPL.005.jpeg" alt="logo"><br><img src="/2017/04/19/BPL/BPL/BPL.006.jpeg" alt="logo"><br><img src="/2017/04/19/BPL/BPL/BPL.007.jpeg" alt="logo"><br><img src="/2017/04/19/BPL/BPL/BPL.008.jpeg" alt="logo"><br><img src="/2017/04/19/BPL/BPL/BPL.009.jpeg" alt="logo"><br><img src="/2017/04/19/BPL/BPL/BPL.010.jpeg" alt="logo"><br><img src="/2017/04/19/BPL/BPL/BPL.011.jpeg" alt="logo"><br><img src="/2017/04/19/BPL/BPL/BPL.012.jpeg" alt="logo"><br><img src="/2017/04/19/BPL/BPL/BPL.013.jpeg" alt="logo"><br><img src="/2017/04/19/BPL/BPL/BPL.014.jpeg" alt="logo"><br><img src="/2017/04/19/BPL/BPL/BPL.015.jpeg" alt="logo"><br><img src="/2017/04/19/BPL/BPL/BPL.016.jpeg" alt="logo"><br><img src="/2017/04/19/BPL/BPL/BPL.017.jpeg" alt="logo"><br><img src="/2017/04/19/BPL/BPL/BPL.018.jpeg" alt="logo"><br><img src="/2017/04/19/BPL/BPL/BPL.019.jpeg" alt="logo"><br><img src="/2017/04/19/BPL/BPL/BPL.020.jpeg" alt="logo"><br><img src="/2017/04/19/BPL/BPL/BPL.021.jpeg" alt="logo"><br><img src="/2017/04/19/BPL/BPL/BPL.022.jpeg" alt="logo"><br><img src="/2017/04/19/BPL/BPL/BPL.023.jpeg" alt="logo"><br><img src="/2017/04/19/BPL/BPL/BPL.024.jpeg" alt="logo"><br><img src="/2017/04/19/BPL/BPL/BPL.025.jpeg" alt="logo"><br><img src="/2017/04/19/BPL/BPL/BPL.026.jpeg" alt="logo"><br><img src="/2017/04/19/BPL/BPL/BPL.027.jpeg" alt="logo"><br><img src="/2017/04/19/BPL/BPL/BPL.028.jpeg" alt="logo"><br><img src="/2017/04/19/BPL/BPL/BPL.029.jpeg" alt="logo"><br><img src="/2017/04/19/BPL/BPL/BPL.030.jpeg" alt="logo"><br><img src="/2017/04/19/BPL/BPL/BPL.031.jpeg" alt="logo"><br><img src="/2017/04/19/BPL/BPL/BPL.032.jpeg" alt="logo"><br><img src="/2017/04/19/BPL/BPL/BPL.033.jpeg" alt="logo"><br><img src="/2017/04/19/BPL/BPL/BPL.034.jpeg" alt="logo"><br><img src="/2017/04/19/BPL/BPL/BPL.035.jpeg" alt="logo"><br><img src="/2017/04/19/BPL/BPL/BPL.036.jpeg" alt="logo"><br><img src="/2017/04/19/BPL/BPL/BPL.037.jpeg" alt="logo"><br><img src="/2017/04/19/BPL/BPL/BPL.038.jpeg" alt="logo"></p>

    
    
    <footer class="meta">
      
      
      
    </footer>
    
  </div>
  
</article>

  <article class="post">
  
    <div class="gallery">
  <div class="photoset">
    
      <img src="">
    
  </div>
  <div class="control">
    <div class="prev"></div>
    <div class="next"></div>
  </div>
</div>
  
  <header>
    
  
    <h1 class="title"><a href="/2016/10/26/stanley/">无人车介绍--斯坦福的stanley</a></h1>
  

    <time datetime="2016-10-26T08:01:47.000Z">
  <span class="day">26</span><span class="month">Oct</span>
</time>
  </header>
  <div class="entry-content">
    
      <p>&#x65AF;&#x5766;&#x798F;&#x7684;&#x65E0;&#x4EBA;&#x8F66;Stanley&#x662F;DARPA(the Defense Advanced Research Projects Agency) 2005&#x6311;&#x6218;&#x8D5B;&#x7684;&#x51A0;&#x519B;&#xFF0C; &#x672C;&#x6587;&#x662F;Stanley&#x8BBA;&#x6587;[1]&#x7684;&#x5F52;&#x7EB3;&#x548C;&#x7B80;&#x8981;&#x5206;&#x6790;, &#x5305;&#x62EC;&#x7CFB;&#x7EDF;&#x7684;&#x8BBE;&#x8BA1;&#x539F;&#x5219;&#x3001;&#x6A21;&#x5757;&#x7EC4;&#x6210;&#xFF0C;&#x4EE5;&#x53CA;&#x53EF;&#x9884;&#x671F;&#x7684;&#x6539;&#x8FDB;&#x3002;<br></p>
    
    
    <footer class="meta">
      
      
      
    </footer>
    
  </div>
  
</article>

  <article class="post">
  
    <div class="gallery">
  <div class="photoset">
    
      <img src="">
    
  </div>
  <div class="control">
    <div class="prev"></div>
    <div class="next"></div>
  </div>
</div>
  
  <header>
    
  
    <h1 class="title"><a href="/2016/08/19/mml/">进一步接近人的智能：多模态机器学习</a></h1>
  

    <time datetime="2016-08-19T03:19:04.000Z">
  <span class="day">19</span><span class="month">Aug</span>
</time>
  </header>
  <div class="entry-content">
    
      <p>&#x4EBA;&#x548C;&#x52A8;&#x7269;&#x901A;&#x8FC7;&#x89C6;&#x3001;&#x542C;&#x3001;&#x8BF4;&#x7B49;&#x9014;&#x5F84;&#x611F;&#x77E5;&#x548C;&#x5B66;&#x4E60;&#xFF0C;&#x672C;&#x8D28;&#x4E0A;&#x662F;&#x591A;&#x6A21;&#x6001;&#x5B66;&#x4E60;&#x3002;&#x8FD1;&#x4E9B;&#x5E74;&#xFF0C;&#x7531;&#x4E8E;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x7684;&#x53D1;&#x5C55;&#xFF0C;&#x591A;&#x6A21;&#x6001;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x8FDB;&#x4E00;&#x6B65;&#x6210;&#x4E3A;&#x4EBA;&#x5DE5;&#x667A;&#x80FD;&#x7684;&#x7814;&#x7A76;&#x70ED;&#x70B9;&#x3002;&#x672C;&#x6587;&#x7B80;&#x5355;&#x4ECB;&#x7ECD;&#x591A;&#x6A21;&#x6001;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7684;&#x5185;&#x5BB9;&#x548C;&#x6311;&#x6218;&#xFF0C;&#x90E8;&#x5206;&#x6458;&#x4E8E;CVPR 2016 &#x548C;ACL 2016&#x7684;Tutorial Multimodal Learning and Reasoning [1], Tutorial on Multimodal Machine Learning [2]&#x3002;</p>
    
    
    <footer class="meta">
      
      
      
    </footer>
    
  </div>
  
</article>

  <article class="post">
  
    <div class="gallery">
  <div class="photoset">
    
      <img src="">
    
  </div>
  <div class="control">
    <div class="prev"></div>
    <div class="next"></div>
  </div>
</div>
  
  <header>
    
  
    <h1 class="title"><a href="/2016/08/17/drl/">智能机器人的新范式：深度强化学习</a></h1>
  

    <time datetime="2016-08-17T02:58:14.000Z">
  <span class="day">17</span><span class="month">Aug</span>
</time>
  </header>
  <div class="entry-content">
    
      <p>&#x8FD1;&#x4E24;&#x5E74;&#x673A;&#x5668;&#x667A;&#x80FD;&#x53D6;&#x5F97;&#x91CD;&#x5927;&#x7A81;&#x7834;&#xFF0C;&#x50CF;&#x56F4;&#x68CB;&#x4E5D;&#x6BB5;&#x9AD8;&#x624B;&#x674E;&#x4E16;&#x77F3;&#x8D25;&#x5317;Alpha Go&#xFF0C;DeepMind&#x56E2;&#x961F;&#x7814;&#x53D1;&#x7684;&#x673A;&#x5668;&#x4EBA;&#x5728;Atari &#x591A;&#x9879;&#x6E38;&#x620F;&#x4E0A;&#x8D85;&#x8D8A;&#x4EBA;&#x7C7B;&#x6C34;&#x5E73;&#x3002;&#x4E3B;&#x8981;&#x5F97;&#x76CA;&#x4E8E;&#x4ECE;&#x57FA;&#x4E8E;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x7684;&#x89C6;&#x89C9;&#x3001;&#x8BED;&#x97F3;&#x3001;&#x8BED;&#x4E49;&#x611F;&#x77E5;&#x5230;&#x52A8;&#x4F5C;&#x53CD;&#x9988;&#x7684;&#x6FC0;&#x52B1;&#x60E9;&#x7F5A;&#x5F3A;&#x5316;&#x8BAD;&#x7EC3;&#x6A21;&#x5F0F;&#x3002;&#x672C;&#x6587;&#x4ECE;&#x6982;&#x5FF5;&#x4E0A;&#x5206;&#x6790;&#x6DF1;&#x5EA6;&#x5F3A;&#x5316;&#x5B66;&#x4E60;&#x7684;&#x8981;&#x70B9;&#xFF0C;&#x90E8;&#x5206;&#x6458;&#x4E8E;ICML 2016 Tutorial&#x91CC;&#x7684;Deep Reinforcement Learning [1]&#x7684;&#x62A5;&#x544A;&#x3002;</p>
    
    
    <footer class="meta">
      
      
      
    </footer>
    
  </div>
  
</article>

  <article class="post">
  
    <div class="gallery">
  <div class="photoset">
    
      <img src="">
    
  </div>
  <div class="control">
    <div class="prev"></div>
    <div class="next"></div>
  </div>
</div>
  
  <header>
    
  
    <h1 class="title"><a href="/2016/08/16/ds-dl/">从概念上看看深度学习为什么成功？</a></h1>
  

    <time datetime="2016-08-16T09:55:21.000Z">
  <span class="day">16</span><span class="month">Aug</span>
</time>
  </header>
  <div class="entry-content">
    
      <p>&#x8FD9;&#x91CC;&#x4EE5;&#x6982;&#x5FF5;&#x5206;&#x6790;&#x4E3A;&#x4E3B;&#x53D9;&#x8FF0;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x7684;&#x90E8;&#x5206;&#x7406;&#x8BBA;&#x57FA;&#x7840;&#x3002;&#x4E3B;&#x8981;&#x6458;&#x5F55;&#x4E86;CVPR 2016 Tutorial&#x91CC;The mathematics of deep learning &#x7684;Data structure based theory for deep learning &#x62A5;&#x544A;&#x8981;&#x70B9;&#x3002;[1]</p>
    
    
    <footer class="meta">
      
      
      
    </footer>
    
  </div>
  
</article>

  <article class="post">
  
    <div class="gallery">
  <div class="photoset">
    
      <img src="">
    
  </div>
  <div class="control">
    <div class="prev"></div>
    <div class="next"></div>
  </div>
</div>
  
  <header>
    
  
    <h1 class="title"><a href="/2016/08/13/chat-bot/">从概念上看看聊天机器人的商业模式</a></h1>
  

    <time datetime="2016-08-13T04:16:13.000Z">
  <span class="day">13</span><span class="month">Aug</span>
</time>
  </header>
  <div class="entry-content">
    
      <p>2016&#x5E74;&#x804A;&#x5929;&#x673A;&#x5668;&#x4EBA;&#x76F8;&#x5173;&#x521B;&#x4E1A;&#x548C;&#x65B0;&#x95FB;&#x5C42;&#x51FA;&#x4E0D;&#x7A77;&#x3002;&#x5B66;&#x672F;&#x652F;&#x6491;&#x548C;&#x5546;&#x4E1A;&#x6A21;&#x5F0F;&#x90FD;&#x6709;&#x54EA;&#x4E9B;&#x53EF;&#x884C;&#x57DF;&#x5462;&#xFF1F;<br></p>
    
    
    <footer class="meta">
      
      
      
    </footer>
    
  </div>
  
</article>

  <article class="post">
  
    <div class="gallery">
  <div class="photoset">
    
      <img src="">
    
  </div>
  <div class="control">
    <div class="prev"></div>
    <div class="next"></div>
  </div>
</div>
  
  <header>
    
  
    <h1 class="title"><a href="/2016/08/13/auto-car/">自动驾驶离我们还有多远?</a></h1>
  

    <time datetime="2016-08-13T02:24:25.000Z">
  <span class="day">13</span><span class="month">Aug</span>
</time>
  </header>
  <div class="entry-content">
    
      <p>&#x73AF;&#x5883;&#x611F;&#x77E5;&#xFF0C;&#x89C4;&#x5212;&#x51B3;&#x7B56;&#x662F;&#x81EA;&#x52A8;&#x9A7E;&#x9A76;&#x7684;&#x91CD;&#x8981;&#x90E8;&#x5206;&#x3002;&#x4E0B;&#x9762;&#x4ECE;&#x5B66;&#x672F;&#x548C;&#x5DE5;&#x4E1A;&#x7684;&#x89D2;&#x5EA6;&#x770B;&#x770B;&#x81EA;&#x52A8;&#x9A7E;&#x9A76;&#x79BB;&#x6211;&#x4EEC;&#x5230;&#x5E95;&#x8FD8;&#x6709;&#x591A;&#x8FDC;&#x3002;<br></p>
    
    
    <footer class="meta">
      
      
      
    </footer>
    
  </div>
  
</article>

  <article class="post">
  
    <div class="gallery">
  <div class="photoset">
    
      <img src="">
    
  </div>
  <div class="control">
    <div class="prev"></div>
    <div class="next"></div>
  </div>
</div>
  
  <header>
    
  
    <h1 class="title"><a href="/2016/08/06/key-dl/">Key Idea of Deep Learning</a></h1>
  

    <time datetime="2016-08-06T03:43:51.000Z">
  <span class="day">6</span><span class="month">Aug</span>
</time>
  </header>
  <div class="entry-content">
    
      <p>The key idea of deep learning is to design appropriate neural network to guide information flow and information transformation.</p>
    
    
    <footer class="meta">
      
      
      
    </footer>
    
  </div>
  
</article>

  <article class="post">
  
    <div class="gallery">
  <div class="photoset">
    
      <img src="">
    
  </div>
  <div class="control">
    <div class="prev"></div>
    <div class="next"></div>
  </div>
</div>
  
  <header>
    
  
    <h1 class="title"><a href="/2016/08/06/hello-world/">Hello World</a></h1>
  

    <time datetime="2016-08-06T03:42:18.000Z">
  <span class="day">6</span><span class="month">Aug</span>
</time>
  </header>
  <div class="entry-content">
    
      <p>Welcome to <a href="https://hexo.io/">Hexo</a>! This is your very first post. Check <a href="https://hexo.io/docs/">documentation</a> for more info. If you get any problems when using Hexo, you can find the answer in <a href="https://hexo.io/docs/troubleshooting.html">troubleshooting</a> or you can ask me on <a href="https://github.com/hexojs/hexo/issues">GitHub</a>.</p>
    
    
    <footer class="meta">
      
      
      
    </footer>
    
  </div>
  
</article>


<nav id="pagenavi">
  
  
  <div class="clearfix"></div>
</nav></div>
  <footer id="footer" class="inner"><div class="social alignright">
  
  
  
  
  <a class="rss" href="/atom.xml" title="RSS">RSS</a>
</div>
<p>
  
  &copy; 2017 Junlong Liu
  
</p>
<div class="clearfix"></div></footer>
  <script src="/js/jquery.imagesloaded.min.js"></script>
<script src="/js/gallery.js"></script>




<link rel="stylesheet" href="/fancybox/jquery.fancybox.css" media="screen" type="text/css">
<script src="/fancybox/jquery.fancybox.pack.js"></script>
<script type="text/javascript">
(function($){
  $('.fancybox').fancybox();
})(jQuery);
</script>


<div id="phasebeam">
  <canvas></canvas>
  <canvas></canvas>
  <canvas></canvas>
</div>
<script src="/js/phasebeam.js"></script>
</body>
</html>