<!DOCTYPE HTML>
<html>
<head>
  <meta charset="utf-8">
  
  <title>从概念上看看聊天机器人的商业模式 | Junlong Liu</title>
  <meta name="author" content="Junlong Liu">

  
  <meta name="description" content="2016&amp;#x5E74;&amp;#x804A;&amp;#x5929;&amp;#x673A;&amp;#x5668;&amp;#x4EBA;&amp;#x76F8;&amp;#x5173;&amp;#x521B;&amp;#x4E1A;&amp;#x548C;&amp;#x65B0;&amp;#x95FB;&amp;#x5C42;&amp;#x51FA;&amp;#x4E0D;&amp;#x7A77;&amp;#x3002;&amp;#x5B66;&amp;#x672F;&amp;#x53EF;&amp;#x884C;&amp;#x6027;&amp;#x548C;&amp;#x5546;&amp;#x4E1A;&amp;#x6A21;&amp;#x5F0F;&amp;#x90FD;&amp;#x6709;&amp;#x54EA;&amp;#x4E9B;&amp;#x53EF;&amp;#x884C;&amp;#x57DF;&amp;#x5462;&amp;#xFF1F;">
  
  

  <link rel="alternate" href="/atom.xml" title="Junlong Liu" type="application/atom+xml">
  <link rel="stylesheet" href="/css/style.css" media="screen" type="text/css">
  <!--[if lt IE 9]><script src="//html5shiv.googlecode.com/svn/trunk/html5.js"></script><![endif]-->
  <script src="//ajax.googleapis.com/ajax/libs/jquery/1.8/jquery.min.js"></script>
  
</head>

<body>
  <header id="header" class="inner"><nav>
  <ul>
    
      <li><a href="/">Home</a></li>
    
      <li><a href="/archives">Archives</a></li>
    
      <li><a href="/about">About</a></li>
    
  </ul>
</nav></header>
  <div id="content" class="inner"><article class="post">
  
    <div class="gallery">
  <div class="photoset">
    
      <img src="">
    
  </div>
  <div class="control">
    <div class="prev"></div>
    <div class="next"></div>
  </div>
</div>
  
  <header>
    
  
    <h1 class="title">从概念上看看聊天机器人的商业模式</h1>
  

    <time datetime="2016-08-13T04:16:13.000Z">
  <span class="day">13</span><span class="month">Aug</span>
</time>
  </header>
  <div class="entry-content">
    
      <p>2016&#x5E74;&#x804A;&#x5929;&#x673A;&#x5668;&#x4EBA;&#x76F8;&#x5173;&#x521B;&#x4E1A;&#x548C;&#x65B0;&#x95FB;&#x5C42;&#x51FA;&#x4E0D;&#x7A77;&#x3002;&#x5B66;&#x672F;&#x53EF;&#x884C;&#x6027;&#x548C;&#x5546;&#x4E1A;&#x6A21;&#x5F0F;&#x90FD;&#x6709;&#x54EA;&#x4E9B;&#x53EF;&#x884C;&#x57DF;&#x5462;&#xFF1F;<br><a id="more"></a><br><img src="/2016/08/13/chat-bot/chat-bog/nlp.jpg" alt="logo"><br>&#x7531;&#x4E8E;&#x8FD1;&#x4E9B;&#x5E74;&#x6765;&#xFF0C;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x7684;&#x53D1;&#x5C55;&#x7ED9;&#x81EA;&#x7136;&#x8BED;&#x8A00;&#x7406;&#x89E3;&#x548C;&#x81EA;&#x7136;&#x8BED;&#x8A00;&#x751F;&#x6210;&#x63D0;&#x4F9B;&#x4E86;&#x65B0;&#x65B9;&#x6CD5;&#x548C;&#x65B0;&#x6280;&#x672F;, &#x4F46;&#x4F9D;&#x7136;&#x79BB;&#x4EBA;&#x7C7B;&#x7684;&#x8BED;&#x8A00;&#x7406;&#x89E3;&#x548C;&#x8868;&#x8FBE;&#x80FD;&#x529B;&#x6709;&#x8D28;&#x7684;&#x5DEE;&#x8DDD;&#x3002;&#x4EE3;&#x8868;&#x6027;&#x7684;&#x5DE5;&#x4F5C;&#x662F;&#x5FAE;&#x8F6F;&#x7684;Tay&#x673A;&#x5668;&#x4EBA;&#xFF0C;&#x53EF;&#x60DC;&#x4E0A;&#x7EBF;&#x5B66;&#x4E60;&#x540E;&#xFF0C;&#x5F88;&#x5FEB;&#x5C31;&#x88AB;&#x7F51;&#x53CB;&#x6559;&#x574F;&#x4E86;&#x3002;&#x4F46;&#x662F;&#x5B66;&#x672F;&#x4E0A;&#x4E3A;&#x7279;&#x5B9A;&#x4EFB;&#x52A1;&#x7684;&#x804A;&#x5929;&#x673A;&#x5668;&#x4EBA;&#x63D0;&#x4F9B;&#x4E86;&#x5F88;&#x591A;&#x6846;&#x67B6;&#xFF0C;&#x5305;&#x62EC;&#x57FA;&#x4E8E;&#x589E;&#x5F3A;&#x5B66;&#x4E60;&#x6846;&#x67B6;&#xFF0C;&#x57FA;&#x4E8E;&#x6A21;&#x677F;&#xFF0C;&#x57FA;&#x4E8E;&#x68C0;&#x7D22;&#x7684;&#x65B9;&#x6CD5;&#x3002;<br><img src="/2016/08/13/chat-bot/chat-bog/tay.png" alt="logo"><br>&#x5546;&#x4E1A;&#x5E94;&#x7528;&#x4E0A;&#xFF0C;&#x5E0C;&#x671B;&#x804A;&#x5929;&#x673A;&#x5668;&#x4EBA;&#x80FD;&#x591F;&#x7406;&#x89E3;&#x4EBA;&#x7684;&#x9700;&#x6C42;&#xFF0C;&#x63D0;&#x4F9B;&#x8BED;&#x8A00;&#x4EA4;&#x4E92;&#xFF0C;&#x5B8C;&#x6210;&#x4E00;&#x5B9A;&#x4EFB;&#x52A1;&#x3002;<br>&#x5F00;&#x653E;&#x57DF;&#x7684;&#x4EFB;&#x52A1;&#xFF0C;&#x8981;&#x6C42;&#x804A;&#x5929;&#x673A;&#x5668;&#x4EBA;&#x50CF;&#x4EBA;&#x4E00;&#x6837;&#x65E0;&#x6240;&#x4E0D;&#x77E5;&#xFF0C;&#x5C5E;&#x4E8E;&#x5F3A;&#x4EBA;&#x5DE5;&#x667A;&#x80FD;&#xFF0C;&#x76EE;&#x524D;&#x5B66;&#x672F;&#x7406;&#x8BBA;&#x8FD8;&#x8FDC;&#x8FBE;&#x4E0D;&#x5230;&#x8FD9;&#x4E9B;&#x6C34;&#x5E73;&#x3002;&#x5728;&#x81EA;&#x7136;&#x8BED;&#x8A00;&#x7406;&#x89E3;&#x548C;&#x751F;&#x6210;&#x5916;&#xFF0C;&#x8FD8;&#x6709;&#x8BB0;&#x5FC6;&#x3001;&#x63A8;&#x7406;&#x7B49;&#x9700;&#x8981;&#x5B66;&#x672F;&#x652F;&#x6301;&#x3002;<br>&#x5C01;&#x95ED;&#x57DF;&#x7684;&#x4EFB;&#x52A1;&#xFF0C;&#x8981;&#x6C42;&#x804A;&#x5929;&#x673A;&#x5668;&#x4EBA;&#x5B8C;&#x6210;&#x4E00;&#x4E2A;&#x7279;&#x5B9A;&#x7684;&#x4EFB;&#x52A1;&#xFF0C;&#x5982;&#x667A;&#x80FD;&#x6295;&#x8D44;&#x987E;&#x95EE;&#x3001;&#x9910;&#x9986;&#x8BA2;&#x9910;&#x673A;&#x5668;&#x4EBA;&#x3002;&#x8FD9;&#x4E9B;&#x65B9;&#x9762;&#x7684;&#x673A;&#x5668;&#x4EBA;&#x5DF2;&#x57FA;&#x672C;&#x5177;&#x5907;&#x7406;&#x8BBA;&#x652F;&#x6301;&#x3002;<br>&#x90A3;&#x4E48;&#x5C01;&#x95ED;&#x57DF;&#x4E0A;&#x7684;&#x804A;&#x5929;&#x673A;&#x5668;&#x4EBA;&#xFF0C;&#x5728;&#x5546;&#x4E1A;&#x843D;&#x5730;&#x4E0A;&#x53C8;&#x6709;&#x4EC0;&#x4E48;&#x6BD4;&#x8F83;&#x597D;&#x7684;&#x6A21;&#x5F0F;&#x5462;&#xFF1F;<br>&#x4FE1;&#x606F;&#x4EA7;&#x4E1A;&#x91CC;&#x6A21;&#x5F0F;&#x4E00;&#x822C;&#x5206;&#x4E3A;&#x9488;&#x5BF9;&#x4F01;&#x4E1A;&#x7AEF;(ToB), &#x9488;&#x5BF9;&#x6D88;&#x8D39;&#x8005;&#x7AEF;(ToC)&#x3002;<br>ToB&#x578B;&#x4E00;&#x822C;&#x9700;&#x8981;&#x6839;&#x636E;&#x516C;&#x53F8;&#x4E1A;&#x52A1;&#x5B9A;&#x5236;&#x4EFB;&#x52A1;&#xFF0C;&#x6536;&#x96C6;&#x6570;&#x636E;&#xFF0C;&#x6BD4;&#x8F83;&#x96BE;&#x5FEB;&#x901F;&#x6210;&#x957F;&#x3002;<br>ToC&#x578B;&#xFF0C;&#x5373;&#x5411;&#x5927;&#x4F17;&#x6D88;&#x8D39;&#x8005;&#x63D0;&#x4F9B;&#x670D;&#x52A1;&#xFF0C;&#x5177;&#x6709;&#x5927;&#x9762;&#x79EF;&#x7684;&#x53D7;&#x4F17;&#xFF0C;&#x6F5C;&#x529B;&#x8F83;&#x5927;&#x3002;&#x540C;&#x65F6;&#xFF0C;&#x5982;&#x679C;&#x73B0;&#x6709;ToC&#x7684;&#x6D88;&#x8D39;&#x8005;&#x4EA7;&#x54C1;&#xFF0C;&#x518D;&#x642D;&#x8F7D;&#x804A;&#x5929;&#x673A;&#x5668;&#x4EBA;&#x4F1A;&#x6709;&#x4E8B;&#x534A;&#x529F;&#x500D;&#x7684;&#x6548;&#x679C;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x8682;&#x8681;&#x91D1;&#x670D;&#x5728;&#x652F;&#x4ED8;&#x5B9D;&#x91CC;&#x642D;&#x8F7D;&#x8BED;&#x97F3;&#x52A9;&#x624B;&#xFF0C;&#x540E;&#x7EED;&#x53EF;&#x80FD;&#x8FD8;&#x6709;&#x667A;&#x80FD;&#x6295;&#x8D44;&#x987E;&#x95EE;&#x3002;&#x5FAE;&#x8F6F;&#x5728;Office&#x8F6F;&#x4EF6;&#x91CC;&#x642D;&#x8F7D;&#x804A;&#x5929;&#x673A;&#x5668;&#x4EBA;&#xFF0C;&#x4E5F;&#x6709;&#x63D0;&#x5347;&#x7528;&#x6237;&#x4F53;&#x9A8C;&#x7684;&#x6548;&#x679C;&#x3002;</p>

    
    
    <footer class="meta">
      
      
      
    </footer>
    
  </div>
  
</article></div>
  <footer id="footer" class="inner"><div class="social alignright">
  
  
  
  
  <a class="rss" href="/atom.xml" title="RSS">RSS</a>
</div>
<p>
  
  &copy; 2016 Junlong Liu
  
</p>
<div class="clearfix"></div></footer>
  <script src="/js/jquery.imagesloaded.min.js"></script>
<script src="/js/gallery.js"></script>




<link rel="stylesheet" href="/fancybox/jquery.fancybox.css" media="screen" type="text/css">
<script src="/fancybox/jquery.fancybox.pack.js"></script>
<script type="text/javascript">
(function($){
  $('.fancybox').fancybox();
})(jQuery);
</script>


<div id="phasebeam">
  <canvas></canvas>
  <canvas></canvas>
  <canvas></canvas>
</div>
<script src="/js/phasebeam.js"></script>
</body>
</html>