<!DOCTYPE HTML>
<html>
<head>
  <meta charset="utf-8">
  
  <title>进一步逼近人的智能：多模态机器学习 | Junlong Liu</title>
  <meta name="author" content="Junlong Liu">

  
  <meta name="description" content="&amp;#x4EBA;&amp;#x548C;&amp;#x52A8;&amp;#x7269;&amp;#x901A;&amp;#x8FC7;&amp;#x89C6;&amp;#x3001;&amp;#x542C;&amp;#x3001;&amp;#x8BF4;&amp;#x7B49;&amp;#x9014;&amp;#x5F84;&amp;#x611F;&amp;#x77E5;&amp;#x548C;&amp;#x5B66;&amp;#x4E60;&amp;#xFF0C;&amp;#x672C;&amp;#x8D28;&amp;#x4E0A;&amp;#x662F;&amp;#x591A;&amp;#x6A21;&amp;#x6001;&amp;#x5B66;&amp;#x4E60;&amp;#x3002;&amp;#x8FD1;&amp;#x4E9B;&amp;#x5E74;&amp;#xFF0C;&amp;#x7531;&amp;#x4E8E;&amp;#x6DF1;&amp;#x5EA6;&amp;#x5B66;&amp;#x4E60;&amp;#x7684;&amp;#x53D1;&amp;#x5C55;&amp;#xFF0C;&amp;#x591A;&amp;#x6A21;&amp;#x6001;&amp;#x673A;&amp;#x5668;&amp;#x5B66;&amp;#x4E60;&amp;#x8FDB;&amp;#x4E00;&amp;#x6B65;&amp;#x6210;&amp;#x4E3A;&amp;#x4EBA;&amp;#x5DE5;&amp;#x667A;&amp;#x80FD;&amp;#x7684;&amp;#x7814;&amp;#x7A76;&amp;#x70ED;&amp;#x70B9;&amp;#x3002;&amp;#x672C;&amp;#x6587;&amp;#x7B80;&amp;#x5355;&amp;#x4ECB;&amp;#x7ECD;&amp;#x591A;&amp;#x6A21;&amp;#x6001;&amp;#x673A;&amp;#x5668;&amp;#x5B66;&amp;#x4E60;&amp;#x7684;&amp;#x5185;&amp;#x5BB9;&amp;#x548C;&amp;#x6311;&amp;#x6218;&amp;#xFF0C;&amp;#x90E8;&amp;#x5206;&amp;#x6458;&amp;#x4E8E;CVPR 2016 &amp;#x548C;ACL 2016&amp;#x7684;Tutorial Multimodal Learning and Reasoning [1], Tutorial on Multimodal Machine Learning [2]&amp;#x3002;">
  
  

  <link rel="alternate" href="/atom.xml" title="Junlong Liu" type="application/atom+xml">
  <link rel="stylesheet" href="/css/style.css" media="screen" type="text/css">
  <!--[if lt IE 9]><script src="//html5shiv.googlecode.com/svn/trunk/html5.js"></script><![endif]-->
  <script src="//ajax.googleapis.com/ajax/libs/jquery/1.8/jquery.min.js"></script>
  
</head>

<body>
  <header id="header" class="inner"><nav>
  <ul>
    
      <li><a href="/">Home</a></li>
    
      <li><a href="/archives">Archives</a></li>
    
      <li><a href="/about">About</a></li>
    
  </ul>
</nav></header>
  <div id="content" class="inner"><article class="post">
  
    <div class="gallery">
  <div class="photoset">
    
      <img src="">
    
  </div>
  <div class="control">
    <div class="prev"></div>
    <div class="next"></div>
  </div>
</div>
  
  <header>
    
  
    <h1 class="title">进一步逼近人的智能：多模态机器学习</h1>
  

    <time datetime="2016-08-19T03:19:04.000Z">
  <span class="day">19</span><span class="month">Aug</span>
</time>
  </header>
  <div class="entry-content">
    
      <p>&#x4EBA;&#x548C;&#x52A8;&#x7269;&#x901A;&#x8FC7;&#x89C6;&#x3001;&#x542C;&#x3001;&#x8BF4;&#x7B49;&#x9014;&#x5F84;&#x611F;&#x77E5;&#x548C;&#x5B66;&#x4E60;&#xFF0C;&#x672C;&#x8D28;&#x4E0A;&#x662F;&#x591A;&#x6A21;&#x6001;&#x5B66;&#x4E60;&#x3002;&#x8FD1;&#x4E9B;&#x5E74;&#xFF0C;&#x7531;&#x4E8E;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x7684;&#x53D1;&#x5C55;&#xFF0C;&#x591A;&#x6A21;&#x6001;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x8FDB;&#x4E00;&#x6B65;&#x6210;&#x4E3A;&#x4EBA;&#x5DE5;&#x667A;&#x80FD;&#x7684;&#x7814;&#x7A76;&#x70ED;&#x70B9;&#x3002;&#x672C;&#x6587;&#x7B80;&#x5355;&#x4ECB;&#x7ECD;&#x591A;&#x6A21;&#x6001;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7684;&#x5185;&#x5BB9;&#x548C;&#x6311;&#x6218;&#xFF0C;&#x90E8;&#x5206;&#x6458;&#x4E8E;CVPR 2016 &#x548C;ACL 2016&#x7684;Tutorial Multimodal Learning and Reasoning [1], Tutorial on Multimodal Machine Learning [2]&#x3002;</p>
<a id="more"></a>
<p>&#x4EBA;&#x5728;&#x751F;&#x6D3B;&#x4E2D;&#x7684;&#x611F;&#x77E5;&#x662F;&#x591A;&#x5143;&#x7684;&#xFF0C;&#x5305;&#x62EC;&#x89C6;&#x89C9;&#x3001;&#x542C;&#x89C9;&#x3001;&#x89E6;&#x89C9;&#x3001;&#x5473;&#x89C9;&#x3001;&#x55C5;&#x89C9;&#x7B49;&#x7B49;&#x3002;&#x4EFB;&#x4F55;&#x611F;&#x77E5;&#x80FD;&#x529B;&#x7684;&#x7F3A;&#x5931;&#x90FD;&#x6709;&#x53EF;&#x80FD;&#x9020;&#x6210;&#x667A;&#x529B;&#x6216;&#x80FD;&#x529B;&#x7684;&#x5F02;&#x5E38;&#x3002;<br><img src="/2016/08/19/mml/human.jpg" alt="logo"><br>&#x57FA;&#x4E8E;&#x6B64;&#xFF0C;&#x591A;&#x6A21;&#x6001;&#x673A;&#x5668;&#x5B66;&#x4E60;(Multimodal Machine Learning) &#x4E3A;&#x673A;&#x5668;&#x63D0;&#x4F9B;&#x591A;&#x6A21;&#x6001;&#x6570;&#x636E;&#x5904;&#x7406;&#x80FD;&#x529B;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x770B;&#x56FE;&#x8BF4;&#x8BDD;&#xFF0C;&#x770B;&#x7535;&#x5F71;&#x7FFB;&#x8BD1;&#x3002;&#x591A;&#x6A21;&#x6001;&#x5B66;&#x4E60;&#x7684;&#x957F;&#x8FDC;&#x76EE;&#x6807;&#x662F;&#x4F7F;&#x673A;&#x5668;&#x5145;&#x5206;&#x611F;&#x77E5;&#x73AF;&#x5883;&#xFF0C;&#x5982;&#x611F;&#x77E5;&#x4EBA;&#x7684;&#x60C5;&#x611F;&#x3001;&#x8A00;&#x8F9E;&#x3001;&#x8868;&#x60C5;&#xFF0C;&#x66F4;&#x667A;&#x80FD;&#x5730;&#x548C;&#x73AF;&#x5883;&#x8FDB;&#x884C;&#x4EA4;&#x4E92;&#x3002;<br><img src="/2016/08/19/mml/rob.jpg" alt="logo"><br>&#x76EE;&#x524D;&#xFF0C;&#x5B66;&#x672F;&#x4E0A;&#x6BD4;&#x8F83;&#x6210;&#x719F;&#x7684;&#x662F;&#x89C6;&#x89C9;&#x548C;&#x8BED;&#x4E49;&#x4E4B;&#x95F4;&#x7684;&#x591A;&#x6A21;&#x6001;&#x5B66;&#x4E60;&#x3002;&#x5982;&#x5BF9;&#x4E00;&#x5F20;&#x56FE;&#x7247;&#x751F;&#x6210;&#x6587;&#x5B57;&#x63CF;&#x8FF0;&#xFF0C;&#x6216;&#x8005;&#x9488;&#x5BF9;&#x4E00;&#x5F20;&#x56FE;&#x7247;&#x7684;&#x5185;&#x5BB9;&#x56DE;&#x7B54;&#x76F8;&#x5E94;&#x7684;&#x6587;&#x5B57;&#x95EE;&#x9898;&#x3002;&#x89C6;&#x89C9;&#x4FE1;&#x606F;&#x901A;&#x5E38;&#x7528;CNN&#x5904;&#x7406;&#xFF0C;&#x6587;&#x672C;&#x4FE1;&#x606F;&#x901A;&#x7545;&#x4F7F;&#x7528;RNN&#x5904;&#x7406;&#xFF0C;&#x770B;&#x56FE;&#x8BF4;&#x8BDD;&#x7684;&#x5B9E;&#x73B0;&#x6846;&#x67B6;&#x53EF;&#x89C1;&#x4E0B;&#x56FE;&#x3002;&#x591A;&#x7EF4;&#x5EA6;&#x6570;&#x636E;&#x5BF9;&#x9F50;&#x7684;&#x65B9;&#x5F0F;&#x6709;attention&#x673A;&#x5236;&#xFF0C;&#x4F8B;&#x5982;&#xFF0C;&#x770B;&#x56FE;&#x8BF4;&#x8BDD;&#x91CC;&#x540D;&#x8BCD;&#x5BF9;&#x5E94;&#x56FE;&#x91CC;&#x9762;&#x54EA;&#x4E2A;&#x7269;&#x4F53;&#x3002;&#x5E76;&#x4E14;&#xFF0C;&#x5728;&#x5F88;&#x591A;&#x4F20;&#x7EDF;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x4EFB;&#x52A1;&#x4E0A;&#xFF0C;&#x591A;&#x6A21;&#x6001;&#x5B66;&#x4E60;&#x4F18;&#x4E8E;&#x5355;&#x6A21;&#x6001;&#x673A;&#x5668;&#x5B66;&#x4E60;&#xFF0C;&#x4F8B;&#x5982;&#xFF0C;&#x8F85;&#x52A9;&#x89C6;&#x89C9;&#x4FE1;&#x606F;&#x7684;&#x6587;&#x672C;&#x7FFB;&#x8BD1;&#x6548;&#x679C;&#x4F18;&#x4E8E;&#x4EC5;&#x4F7F;&#x7528;&#x6587;&#x672C;&#x4FE1;&#x606F;&#x3002;<br><img src="/2016/08/19/mml/qa.jpg" alt="logo"><br><img src="/2016/08/19/mml/cnnrnn.jpg" alt="logo"><br><img src="/2016/08/19/mml/att.jpg" alt="logo"></p>
<p>&#x5F53;&#x7136;&#xFF0C;&#x73B0;&#x5728;&#x591A;&#x6A21;&#x6001;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x8FD8;&#x5B58;&#x5728;&#x5F88;&#x591A;&#x6311;&#x6218;&#x3002;&#x5305;&#x62EC;&#x591A;&#x7EF4;&#x5EA6;&#x6570;&#x636E;&#x7684;&#x5404;&#x81EA;&#x8868;&#x793A;&#x3001;&#x878D;&#x5408;&#x3001;&#x5BF9;&#x9F50;&#x3001;&#x534F;&#x540C;&#x5B66;&#x4E60;&#xFF0C;&#x8FD8;&#x6709;&#x5F85;&#x5B66;&#x672F;&#x7406;&#x8BBA;&#x7684;&#x4E30;&#x5BCC;&#x548C;&#x5B8C;&#x5584;&#xFF0C;&#x4F46;&#x5E94;&#x7528;&#x524D;&#x666F;&#x975E;&#x5E38;&#x5E7F;&#x6CDB;&#x3002;<br><img src="/2016/08/19/mml/cha.jpg" alt="logo"></p>
<p>[1] <a href="https://sites.google.com/site/multiml2016cvpr/" target="_blank" rel="external">https://sites.google.com/site/multiml2016cvpr/</a><br>[2] <a href="http://acl2016.org/index.php?article_id=59" target="_blank" rel="external">http://acl2016.org/index.php?article_id=59</a></p>

    
    
    <footer class="meta">
      
      
      
    </footer>
    
  </div>
  
</article></div>
  <footer id="footer" class="inner"><div class="social alignright">
  
  
  
  
  <a class="rss" href="/atom.xml" title="RSS">RSS</a>
</div>
<p>
  
  &copy; 2016 Junlong Liu
  
</p>
<div class="clearfix"></div></footer>
  <script src="/js/jquery.imagesloaded.min.js"></script>
<script src="/js/gallery.js"></script>




<link rel="stylesheet" href="/fancybox/jquery.fancybox.css" media="screen" type="text/css">
<script src="/fancybox/jquery.fancybox.pack.js"></script>
<script type="text/javascript">
(function($){
  $('.fancybox').fancybox();
})(jQuery);
</script>


<div id="phasebeam">
  <canvas></canvas>
  <canvas></canvas>
  <canvas></canvas>
</div>
<script src="/js/phasebeam.js"></script>
</body>
</html>