<!DOCTYPE HTML>
<html>
<head>
  <meta charset="utf-8">
  
  <title>从概念上看看深度学习为什么成功？ | Junlong Liu</title>
  <meta name="author" content="Junlong Liu">

  
  <meta name="description" content="&amp;#x8FD9;&amp;#x91CC;&amp;#x4EE5;&amp;#x6982;&amp;#x5FF5;&amp;#x5206;&amp;#x6790;&amp;#x4E3A;&amp;#x4E3B;&amp;#x53D9;&amp;#x8FF0;&amp;#x6DF1;&amp;#x5EA6;&amp;#x5B66;&amp;#x4E60;&amp;#x7684;&amp;#x90E8;&amp;#x5206;&amp;#x7406;&amp;#x8BBA;&amp;#x57FA;&amp;#x7840;&amp;#x3002;&amp;#x4E3B;&amp;#x8981;&amp;#x6458;&amp;#x5F55;&amp;#x4E86;CVPR 2016 Tutorial&amp;#x91CC;The mathematics of deep learning &amp;#x7684;Data structure based theory for deep learning &amp;#x62A5;&amp;#x544A;&amp;#x8981;&amp;#x70B9;&amp;#x3002;[1]">
  
  

  <link rel="alternate" href="/atom.xml" title="Junlong Liu" type="application/atom+xml">
  <link rel="stylesheet" href="/css/style.css" media="screen" type="text/css">
  <!--[if lt IE 9]><script src="//html5shiv.googlecode.com/svn/trunk/html5.js"></script><![endif]-->
  <script src="//ajax.googleapis.com/ajax/libs/jquery/1.8/jquery.min.js"></script>
  
</head>

<body>
  <header id="header" class="inner"><nav>
  <ul>
    
      <li><a href="/">Home</a></li>
    
      <li><a href="/archives">Archives</a></li>
    
      <li><a href="/about">About</a></li>
    
  </ul>
</nav></header>
  <div id="content" class="inner"><article class="post">
  
    <div class="gallery">
  <div class="photoset">
    
      <img src="">
    
  </div>
  <div class="control">
    <div class="prev"></div>
    <div class="next"></div>
  </div>
</div>
  
  <header>
    
  
    <h1 class="title">从概念上看看深度学习为什么成功？</h1>
  

    <time datetime="2016-08-16T09:55:21.000Z">
  <span class="day">16</span><span class="month">Aug</span>
</time>
  </header>
  <div class="entry-content">
    
      <p>&#x8FD9;&#x91CC;&#x4EE5;&#x6982;&#x5FF5;&#x5206;&#x6790;&#x4E3A;&#x4E3B;&#x53D9;&#x8FF0;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x7684;&#x90E8;&#x5206;&#x7406;&#x8BBA;&#x57FA;&#x7840;&#x3002;&#x4E3B;&#x8981;&#x6458;&#x5F55;&#x4E86;CVPR 2016 Tutorial&#x91CC;The mathematics of deep learning &#x7684;Data structure based theory for deep learning &#x62A5;&#x544A;&#x8981;&#x70B9;&#x3002;[1]</p>
<a id="more"></a>
<p>&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x7684;&#x6838;&#x5FC3;&#x7ED3;&#x6784;&#x662F;&#x6DF1;&#x5EA6;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x3002;<br>&#x6DF1;&#x5EA6;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x662F;&#x4E00;&#x7CFB;&#x5217;&#x7EBF;&#x6027;&#x548C;&#x975E;&#x7EBF;&#x6027;&#x53D8;&#x5316;&#x7684;&#x7F51;&#x7EDC;&#x5C42;&#x5806;&#x53E0;&#x3002;<br><img src="/2016/08/16/ds-dl/dnn.jpg" alt="logo"><br>&#x6DF1;&#x5EA6;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7684;&#x82E5;&#x5E72;&#x91CD;&#x8981;&#x7406;&#x8BBA;&#x6027;&#x8D28;&#x5305;&#x62EC;&#xFF1A;<br>    1&#xFF0C;&#x53EF;&#x8868;&#x793A;&#x4EFB;&#x610F;&#x51FD;&#x6570;&#xFF08;Universal approximation for any measurable Borel functions&#xFF09;&#xFF1B;<br>    2&#xFF0C;&#x968F;&#x7740;&#x6DF1;&#x5EA6;&#x589E;&#x52A0;&#xFF0C;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7684;&#x8868;&#x8FBE;&#x80FD;&#x529B;&#x5448;&#x6307;&#x6570;&#x589E;&#x957F;&#xFF1B;<br>    3&#xFF0C;&#x968F;&#x7740;&#x6DF1;&#x5EA6;&#x589E;&#x52A0;&#xFF0C;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x6709;&#x66F4;&#x591A;&#x7684;&#x5C40;&#x90E8;&#x6700;&#x4F18;&#x70B9;&#x63A5;&#x8FD1;&#x5168;&#x5C40;&#x6700;&#x4F18;&#x70B9;&#x3002;</p>
<p>&#x4ECE;&#x5177;&#x4F53;&#x7684;&#x7F51;&#x7EDC;&#x5C42;&#x7684;&#x7ED3;&#x6784;&#x8BBE;&#x8BA1;&#x548C;&#x6570;&#x503C;&#x521D;&#x59CB;&#x5316;&#x6765;&#x8BF4;&#xFF1A;<br>    1&#xFF0C;&#x6DF1;&#x5EA6;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x53EF;&#x4EE5;&#x4FDD;&#x7559;&#x8F93;&#x5165;&#x6570;&#x636E;&#x7684;&#x91CD;&#x8981;&#x4FE1;&#x606F;&#xFF1B;<br>        &#x5373;&#x901A;&#x8FC7;&#x4E00;&#x5C42;&#x7F51;&#x7EDC;&#x53D8;&#x6362;&#x540E;&#x7684;&#x4FE1;&#x606F;&#x548C;&#x8F93;&#x5165;&#x4FE1;&#x606F;&#x7684;&#x5DEE;&#x5F02;&#x6709;&#x4E0A;&#x9650;&#x7406;&#x8BBA;&#x4FDD;&#x8BC1;&#x3002;<br><img src="/2016/08/16/ds-dl/info.jpg" alt="logo"><br>    2&#xFF0C;&#x4F7F;&#x7528;&#x968F;&#x673A;&#x9AD8;&#x65AF;&#x5206;&#x5E03;&#x521D;&#x59CB;&#x5316;&#x6743;&#x503C;&#xFF0C;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x80FD;&#x4FDD;&#x6301;&#x6837;&#x672C;&#x95F4;&#x7684;&#x8DDD;&#x79BB;&#x548C;&#x89D2;&#x5EA6;&#x5E8F;&#x5173;&#x7CFB;&#xFF1B;<br><img src="/2016/08/16/ds-dl/dis.jpg" alt="logo"><br>    3&#xFF0C;&#x6DF1;&#x5EA6;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7684;&#x6CDB;&#x5316;&#x80FD;&#x529B;&#x5177;&#x6709;&#x7406;&#x8BBA;&#x4FDD;&#x8BC1;&#xFF1B;<br>        &#x5373;&#x6DF1;&#x5EA6;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x5728;&#x8BAD;&#x7EC3;&#x96C6;&#x548C;&#x6D4B;&#x8BD5;&#x96C6;&#x7684;&#x7CBE;&#x5EA6;&#x8BEF;&#x5DEE;&#x5B58;&#x5728;&#x7406;&#x8BBA;&#x4E0A;&#x7EBF;&#x3002;<br><img src="/2016/08/16/ds-dl/ge.jpg" alt="logo"></p>
<p>&#x4EE5;&#x4E0A;&#x8FF0;&#x82E5;&#x5E72;&#x6027;&#x8D28;&#x4E3A;&#x57FA;&#x7840;&#xFF0C;&#x8BBE;&#x8BA1;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7ED3;&#x6784;&#x548C;&#x76EE;&#x6807;&#x51FD;&#x6570;&#x4EE5;&#x5F15;&#x5BFC;&#x4FE1;&#x606F;&#x7684;&#x53D8;&#x6362;&#x548C;&#x6D41;&#x52A8;&#xFF0C;&#x8F85;&#x4EE5;&#x5408;&#x9002;&#x7684;&#x521D;&#x59CB;&#x5316;&#x548C;&#x8BAD;&#x7EC3;&#x65B9;&#x6CD5;&#xFF0C;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x5728;&#x5F88;&#x591A;&#x4EFB;&#x52A1;&#x4E0A;&#x83B7;&#x5F97;&#x4E86;&#x7A81;&#x7834;&#x6027;&#x8FDB;&#x5C55;&#x3002;&#x5C24;&#x5176;&#x662F;&#x975E;&#x7ED3;&#x6784;&#x5316;&#x6570;&#x636E;&#x7684;&#x5904;&#x7406;&#xFF0C;&#x8BED;&#x97F3;&#xFF0C;&#x6587;&#x672C;&#xFF0C;&#x56FE;&#x50CF;&#x7B49;&#x7B49;&#x3002;</p>
<p>[1] <a href="http://www.vision.jhu.edu/tutorials/CVPR16-Tutorial-Math-Deep-Learning-Raja.pdf" target="_blank" rel="external">http://www.vision.jhu.edu/tutorials/CVPR16-Tutorial-Math-Deep-Learning-Raja.pdf</a></p>

    
    
    <footer class="meta">
      
      
      
    </footer>
    
  </div>
  
</article></div>
  <footer id="footer" class="inner"><div class="social alignright">
  
  
  
  
  <a class="rss" href="/atom.xml" title="RSS">RSS</a>
</div>
<p>
  
  &copy; 2017 Junlong Liu
  
</p>
<div class="clearfix"></div></footer>
  <script src="/js/jquery.imagesloaded.min.js"></script>
<script src="/js/gallery.js"></script>




<link rel="stylesheet" href="/fancybox/jquery.fancybox.css" media="screen" type="text/css">
<script src="/fancybox/jquery.fancybox.pack.js"></script>
<script type="text/javascript">
(function($){
  $('.fancybox').fancybox();
})(jQuery);
</script>


<div id="phasebeam">
  <canvas></canvas>
  <canvas></canvas>
  <canvas></canvas>
</div>
<script src="/js/phasebeam.js"></script>
</body>
</html>